["What's the difference between Paul Walker and a computer? I give a fuck when my computer crashes.","My Grandpa said, \"Your generation relies too much on technology!\" I replied, \"No, your generation relies too much on technology!\" Then I unplugged his life support.","What do you call a five year old with no friends? A sandy hook survivor.","Jesus Christ fed 2,000 people with 5 loaves of bread and 2 fish, but Adolf Hitler made 6 million Jews toast.","What's the worst thing about breaking up with a Japanese girl? You have to drop the bomb twice before she gets the message.","What did the boy with no hands get for Christmas? GLOVES! Nah, just kidding... He still hasn't unwrapped his present.","How do Ethiopians celebrate their kids first birthday? By putting flowers on the grave.","How did Rihanna find out Chris Brown was cheating on her? She found another woman's lipstick on his knuckles.","How can you tell if your wife is dead? The sex is the same but the dishes start piling up.","Why do Mexicans never have Sex Ed. and Driver's Ed. on the same day? They have to give the donkey a break at some point.","Feminism","So I suggested to my wife that she'd look sexier with her hair back… Which is apparently an insensitive thing to say to a cancer patient.","Most black 15 year-olds in this country are decent, law abiding citizens. It's their kids who cause all the trouble.","How many feminists does it take to change a light bulb? Don't be stupid, feminists can't change anything.","What is a pedophile's favorite part about Halloween? Free delivery.","So I painted my laptop black, hoping it would run faster… Now it doesn't work.","How do you kill a redneck? Wait 'till he fucks his sister then cut the brakes on his house.","What's the difference between a gay man and a freezer? Freezer doesn't fart when you pull the meat out.","What do you tell a woman with two black eyes? Nothing you already done told her twice.","How do you fit 4 queers on a barstool? Flip it upside-down.","Why do Jews have big noses? Because air is free.","What happened when the jew walked into the wall with a hard-on? He broke his nose.","How long does it take for a black woman to take a shit? Nine months.","How do you get a nun pregnant? Dress her up like an altarboy.","What do you call 40 mexicans buried up to their neck in sand? A spicket fence.","How many women does it take to screw in a lightbulb? None, they just sit in the dark and bitch.","Did you hear about the two car pile up in Mexico? 200 Mexicans died.","What kind of file do you need to turn a 15mm hole into a 40mm hole? A pedophile.","What's a pedophile's favorite part of a hockey game? Before the First Period.","How do you swat 200 flies at one time? Hit an Ethiopian in the face with a frying pan.","What is a redneck virgin? A seven year old that can run faster than her brothers.","How many feminists does it take to change a light bulb? One, she just holds the bulb to the socket and waits for the world to revolve around her.","Girls are like blackjack… I'm trying to go for 21 but I always hit on 14.","Why does Stephen Hawking do one-liners? Because he can't do stand up.","Did you hear the Score of the Egypt vs Ethiopia soccer game? Egypt 8, Ethiopia didn't.","How many cops does it take to change a light bulb? They don't. They arrest the bulb for being broke and beat the room for being black.","What's 9 inches long, pink, and makes my girlfriend scream when I put it in her mouth? Her miscarriage.","A Jew, a black, and a Muslim are on a frozen lake, not talking to each other, so I thought I would go over there and break the ice.","What's difference between dollars and Jews? I'd give a shit if I lost 6 million dollars.","How does a black woman know she is pregnant? When she pulls her tampon out the cotton is already picked.","Whats the difference between George Zimmerman and Trayvon Martin? Zimmerman knew how to dodge a bullet.","One time I fucked this chick so hard, she almost came back to life","I don't understand why Obama has to give his speeches behind bullet proof glass. I mean, I know he's black and all, but I doubt he'll shoot anyone.","What's the difference between a Jew and harry potter? Harry can escape the chamber.","What do you call a woman who thinks she can do anything a man can do? Wrong.","Whats the difference between a hippie chick and a hockey player? A hockey player showers after 3 periods.","What's the difference between cancer and Black people? Cancer got Jobs.","What do Sarah Palin and Iron Man have in common? They both had a downey jr inside of them.","What's a word that white people can call white people, but black people can't call black people? Dad.","What do you say when you see your T.V. floating in the middle of the night? Drop it nigger!!","Whats the difference between a truckload of bowling balls and a truckload of dead babies? I can't unload a truckload of bowling balls with a pitchfork","How do you blindfold a Chinese man? Dental floss!","Why are black people so fast? Because all the slow one are in the jail.","What's the difference between a drug dealer and a hooker? A hooker can wash her crack and sell it again.","Why do brides wear a white dress? So that the dishwasher matches the washing machine.","What do you call a bunch of black people running down a hill? A jail break.","What's faster than a nigga stealing your TV? His brother with your xbox.","What's the toughest thing about eating bald pussy? Putting the diaper back on.","What do you call an ethiopian with a bag of rice? A restaurant owner","How can you tell if a nigga is pregnant? Have her squat on a watermelon and check it for teeth marks.","What's 7 inches long and hasn't been sucked in over 2 years? Whitney Houston's crack pipe","What's the difference between a 4 year old boy and a bag of cocaine? Eric Clapton wouldn't let a bag of cocaine fall out a window","What's the difference between a woman and a computer? You can punch information into a computer.","How do you make a gay fuck a woman? Shit in her cunt.","What's better than winning a gold medal at the Special Olympics? Not being retarded.","What does a nigga and an apple have in common? Both look great hanging from a tree.","the parents of the sandy hook victims should of kept the Christmas receipts.","Have you ever had Ethiopian food? Neither have they.","How do you start a rave in Ethiopia? Staple food to the ceiling.","Why don't black people go on cruises? They're not falling for that one again.","What's the most confusing day in Detroit? Father's day.","What's the hardest part of watching a school bus full of kindergarteners go off a cliff? The erection.","What's black and blue, and scares mothers everywhere? Crib death.","What's the difference between a pair of jeans and an ethiopian? A pair of jeans only has one fly on it.","Fat logic","What's faster than a speeding bullet? A jew with a coupon.","How did Hitler kill so many Jews? Free transportation","What's the difference between a baby and a watermelon? One is fun to shoot and the other is fun to eat.","How do you stop a baby from crawling in circles? Nail it's other hand to the floor.","Black dads coming home.","How do you get a dead baby out of a blender? Nachos.","How do you stop a Mexican tank? You shoot the guy pushing it.","I just gave my sister head. First time eating cheese.","How do you fuck a special person? You go down.","Why can't you fool an aborted baby? Cause it wasn't born yesterday.","Why did Hitler kill himself? He got the gas bill.","How do you turn a fruit into a vegetable? AIDS.","How did Jesus walk on water? Shit floats","How does a black woman fight crime? She gets an abortion.","How do you drown a nigga? You pop their lips.","Why can't Mexicans play UNO? They steal all the green cards.","What's the worst thing about being black and Jewish? Having to sit in the back of the oven.","What do you get if you put a baby in a blender? An erection.","What do fat chicks and bricks have in common? They both get laid by Mexicans.","What's pale, white, and bounces up and down in a baby's crib? A pedophile's ass.","What's the difference between a jew and a pizza? A pizza don't scream when you put it in the oven.","How do you get a white girl to suck your dick? Put mayonnaise on it.","What's the difference between a nigger and a pile of dog shit? Eventually the pile of dog shit will turn white and stop stinking.","What's the difference between jelly and jam? I can't jelly my dick down a baby's throat.","What do a nigger and a sperm have in common? Both have a one in a million chance of becoming a human being.","What's the difference between a Taliban outpost and a Pakistani elementary school? I don't know, I just fly the drone!","A guy was walking to a bar and on his way he found a girl tied up to the railroad tracks. He untied her and they had sex. Guy gets to the bar, friends ask why he's so late, tells them about the girl he found and all the different positions they fucked in. Friends give him props and ask if he got head, guy replies \"I couldn't find it.\"","A man goes into a library and asks the librarian for a book on suicide. The librarian says 'fuck off you won't bring it back'","A guy goes into the library and asks the librarian \"Do you have the new book on small penises?\" She replies \"Sorry, I don't think it's in yet.\" He says, \"Yeah, that's the one.\"","What's the difference between John Wayne and Jack Daniels? Jack Daniels is still killing indians.","What's the difference between Hitler and Michael Phelps? Michael Phelps can finish a race.","What's the difference between Hitler and the Boston Marathon Bomber? Hitler couldn't end a race.","What do you call 5 black people having sex? A threesome.","How many cops does it take to change a lightbulb? Two: one to beat the room for being black and one to arrest the lightbulb for being broke.","US and Ethiopia national teams played a friendly the other day. The final score was USA 8-Ethiopia didn't.","My best friend got mad at me because he caught me sniffing his sisters panties. It didn't help that they were still on her. Or that all of his family was there too. It really made the rest of her funeral really awkward.","Don't let an extra chromosome get you down.","How do you start a rave in Ethiopia? Nail a piece of toast to the ceiling.","Have you ever had Ethiopian food? No? Neither have they!","Did You Know? Ethiopia has an obesity rate of 1.1%, the lowest in the world! ","What do you call an Ethiopian family photo? A barcode.","I added Princess Diana on Xbox Live recently. Never plays any games, she's always on the dashboard.","Why is Princess Diana like Pink Floyd? Her last big hit was The Wall.","What do you think was the last thing going through Princess Diana's mind? The steering wheel.","Why does Hellen Keller wear tight pants? So you can read her lips.","Why does Hellen Keller masturbate using only one hand? So she can moan with the other.","How did Hellen Keller's parents punish her? They left a plunger sticking up in the toilet.","Helen Keller falls off of a cliff, why can't she scream for help? She's wearing mittens!","A sadist, necrophiliac, pyromaniac, zoophiliac, and a masochist were sitting in a jail cell together. The zoophiliac says, \"I want to have sex with a cat.\" The sadist says, \"I want to torture a cat then have sex with it.\" The pyromaniac says, \"I wanna torture the cat, set it on fire, then have sex with it.\" The necrophiliac says, \"Well I want to torture the cat, set it on fire, have sex with it, then kill it and have sex with it again.\" Finally, the masochist says, \"Meow.\"","How many potatoes does it take to kill an Irish man? None.","A woman brings eight-year-old Johnny home and tells his mother that he was caught playing doctors and nurses with Mary, her eight-year-old daughter. Johnny's mother says, \"Let's not be too harsh on them... they are bound to be curious about sex at that age.\" - \"Curious about sex?\" replies Mary's mother. \"He's taken her fucking appendix out!\"","How many babies does it take to paint a wall? Depends on how hard you throw them.","How many babies does to take to shingle a roof? Depends how thin you slice 'em.","Why did Princess Diana cross the road? Inertia.","Who are the fastest readers? 9/11 jumpers: 87 stories in less than 2 minutes.","What's Al Qaeda's favorite football team? The New York Jets.","What's Osama Bin Laden's favourite drink? A double Manhattan.","So my wife walked in on me fucking my son, I don't know what is more shocking, the look on my wife's face or the fact that the abortion clinic let me keep him.","A father is showering in the morning when his young daughter stumbles into the bathroom. She opens the curtain and notices his penis to which she says, \"Daddy what's that?\" Seeing it as a teachable moment the father replies, \"That's my penis sweetie.\" The daughter quickly asks, \"Will I ever get one?\" The father chuckles and responds, \"As soon as your mother leaves for work.\"","What's the worst part about being a black jew? You have to sit in the back of the oven.","Why does Eric Clapton use a Mac? Because windows killed his son.","Difference between a bag of cocaine and a four year old? Eric Clapton would never let a bag of cocaine fall out of a 49 story window.","What does a baby look like after its been in the microwave for 30 seconds? I don't know, I close my eyes when I masturbate.","How do you get a baby into a small bowl? With a blender. How do you get it out? Tortilla chips.","What's the hardest thing about microwaving a vegetable? Fitting the wheelchair through the door.","What's the opposite of Christopher Reeve? Christopher Walken.","Why can't Stevie Wonder drive a bus? There is no steering wheel at the back of the bus.","I bought my blind friend a cheese grater for his birthday. A week later whilst we were talking, he said it was the most violent book he'd ever read.","\"Your generation is too reliant on technology,\" said my grandpa. \"No, your generation is too reliant on technology,\" I retorted as I pulled the plug on his life support to further prove my point.","What's red and crawls up your leg? A homesick miscarriage.","What did the hotdog vendor say when he was pulled from the WTC rubble? So who ordered the two jumbos?","Why can't you fool an aborted baby? Cause it wasn't born yesterday.","Why did Princess Diana cross the road? Cause she wasn't wearing a seatbelt.","Why did Sally fall off the swings? Because she had no arms.","So I was walking around town yesterday and passed by a gun store. Intrigued, I entered to find that everything was half off. I didn't know that Back to School sales had already started.","A man called 911 and said \"Come quick, my son swallowed a condom!\" 5 minutes later, he called again and said, \"never mind, I found another one\".","Statistically, 9 out of 10 people enjoy gang rape!","How do you get a baby to stop crawling around in circles? Nail its other foot to the ground.","What did the kid with no hands get for christmas? Gloves! Just kidding he hasn't opened it yet.","How does a Tasmanian know his Mother has her period? His brother's dick tastes funny.","What's Belgium famous for? Chocolates and child abuse, and they only invented the chocolates to get to the kids.","What breaks when you give it to a two year old? Their pelvis.","What's round and hates Pakis? The world.","What's worse than the Holocaust? Six million Jews.","What's the best thing about twenty-three year olds? There's twenty of them.","What's 16\" long, stiff and makes women scream? Cot death.","What's 12 inches long, black, and makes your girlfriend scream? Frostbitten stillbirth.","What's the difference between a dead baby and an apple? I don't cum on an apple before I eat it.","What's the difference between a dead baby and a driveway? Nobody complains when I pull out of my driveway...","You really gotta hand it to blind prostitutes.","What's the difference between a dead baby and a Cadillac? I've never been inside a Cadillac.","What do you call a bunch of dead black people in a barn? Outdated farm equipment.","Don't you hate it when you remember your dog was put down after you've already slathered your balls in peanut butter?","What's the difference between a baby and an orange? I don't fuck an orange after I peel its skin off.","What would George Washington be doing if he were alive right now? Screaming and scratching at the top of his coffin.","What's the difference between Elliot Rodger and an egg? An egg gets laid before it cracks.","What is the difference between a black person and cancer? Cancer got jobs.","A priest, a pedophile, and a rapist walk into a bar. And that's just the first guy.","What do you call a 6 year old with no friends? A Sandy Hook survivor.","What has more brains than a Sandy Hook Elementary schooler? The wall behind it.","What has 2 heads, 5 arms and 3 legs? The finish line of Boston Marathon. I hear it's a blast.","I wanted to treat my girlfriend like a princess for one night. So I took her out, got her drunk, and crashed the car.","Why did Jesus die on the cross? He forgot his safe word.","Two Jews jump off a cliff to see who hits the ground first. Who wins? Society.","A beautiful woman was standing on the edge of a bridge, about to jump off. An old stinky bum walks up and she sees him approaching. She says \"Go away! There's nothing you can say that'll stop me!\" \"Well if you're going to kill yourself anyway, why not have sex with me? At least I'll enjoy it.\" \"No! That's disgusting!\" She says, and the old bum shrugs and starts walking away. \"Wait!\" She says. \"Is that all you're going to say?! Where are you going?!\" \"Down to the bottom. If I hurry, you'll still be warm.\"","What's the difference between a grade school and a terrorist training camp? Look... I just fly the drone. ","How many babies does it take to change a lightbulb? Well I've got at least 8 in my basement and it's still dark.","You can say what you want about deaf people.","So these two muffins are in an oven right, and this one muffin says to- oh wait, they were Jews. So these two Jews are in an oven right?","There would be no reason to use a fleshlight if babies didn't cry.","What's the best way to put a baby in a blender? Upside down, I like the way its toes are bending.","What's the hardest thing about putting a baby in a blender? My dick.","Where did Sally go when the bombs fell? Everywhere.","Why does NASA drink Sprite? Because they couldn't get 7up.","What's hard to find at a florida nightclub? A pulse.","What do you call MJ's newest hit single? Underground Music."]