[
"Oi mate, one hundred percent, truly ruly, you are a total faggot. ",
"Cunt's fucked. ",
"Oi this is you: HURR DURR LOOK AT ME I'M AN AMERICAN I LIKE GUNS AND LIVE IN A TRAILER! ",
"You ugly fucken dog cunt. ",
"I hope your chooks turn into emus and kick your shithouse down. ",
"\n>2016\n\n",
"\n>Actually supporting Trump.\n\n",
"\n>Being that fucking gay.\n\n",
"Go have a sook. ",
"Don't be dog, bro. ",
"HAHAHAHAHAHAHAHAHAHAHAHAHA! ",
"HAHAHA! HE'S NEVER EVEN HAD A LAMINGTON! ",
"I bet your mum didn't even let you watch Cheez TV before school. ",
"This cunt's as useless as tits on a bull. ",
"Go punch cones under a bridge or something you fucken wanker. ",
"Fucked so many girls in Bali last year. ",
"Could you just take one second out of your day to stop buggering blokes, you fucking bum burglar? ",
"I bet you don't even drive a ute ya poof. ",
"That's fucking chat bro! ",
"Get out of it ya bloody backdoor bandit. ",
"Are you even a real fascist, mate? ",
"We invented The fucking Wiggles, cunt. What have you done? ",
"Go pash a pooper you pillow biter. ",
"We just got rid of our guns in Australia and now it's safer than ever, what are you bloody doing, America? ",
"Oi, you hear that new Jack Johnson track? Fucking so sick, bro. So sick. ",
"You've got a face like a smacked bum, mate. ",
"I'm just kidding mate, you're pretty fair dinkum. ",
"Yeah, I was a bit iffy about it, but then I thought \"What would Warnie do?\" and I fucked her in the bum. ",
"You look like the south end of a northbound camel. ",
"There is literally nothing wrong with supporting Bernie Sanders. ",
"Mike Enoch is LITERALLY a jew. ",
"Make a sentence out of \"fucked\" and \"get\", mate. ",
"You flaming galah. ",
"I'd better keep an eye on you mate, don't want to catch you buggering one of my jumbucks when I turn my back. ",
"Oi I bet you don't even know which time preference is the good one. ",
"Mate could you stop being a fucken faggot for like one second please? ",
"What's it like to not live in the greatest country to ever exist? ",
"Tie me kangaroo down, sport. ",
"Yeah go ahead, chuck a fucking spaz mate, I still fucked your mum. ",
"I don't know what you're on about, mate. ",
"Fuck me, I'm out of VB! ",
"American football sucks dingo dick, play a real sport like AFL. ",
"Oi this cunt buys his groceries at Bi-Lo, what a fucking pov! ",
"How many Weet-Bix do you do, mate? Any less than ten and you're a soft cunt. ",
"You stupid bloody ning nong. ",
"You silly bugger. ",
"\n>He doesn't even have free healthcare.\n\n",
"Absolute fucking dropkick. ",
"I don't give a rats arse, mate. ",
"Your mum was a pretty good root, bro. ",
"Do you even root sheilahs, mate? ",
"We must secure the existence of madcunts and a future for madcunts' kids. ",
"top kek. ",
"Yeah grouse mate. ",
"Piss off, mate. ",
"Hooroo. ",
"Hang on just need to pop on down to the servo to pick up some durries... Alright I'm back now. ",
"I grew here, you flew here. ",
"Look at this gronk. ",
"You want to have a bit of a biffo, do ya? ",
"Aw ripper! ",
"You're madder than a cut snake. ",
"Everyone look at the big sooky baby. ",
"I wouldn't trust ya as far as I could throw ya. ",
"Why do you even need a car, just use public transport. ",
"Fuck, it's like you don't even care about your carbon footprint. ",
"You are LITERALLY a jew. ",
"All these fucken drongos. ",
"Go have a big old sook. ",
"I hope your ears turn into arseholes and shit all over your shoulders. ",
"Oi! You cheeky cunt. ",
"What do you think you're doing? ",
"Look at this bloody galah. ",
"You bum-tickling pooftah. ",
"You bloody boofhead. ",
"Yeah bet you'd like a go, fucken doodle diddler. ",
"Yeah real fucken funny cunt. ",
"I saw your mum sucking a dead dog's donger the other day. It's true. ",
"Go get a job you fucking dero cunt. ",
"Just kidding mate. ",
"Just having a bit of a giggle. ",
"Calm ya fucking farm. ",
"Oi, you are a fucking faggot though. ",
"You've got about as much agency as a boong has brain cells. ",
"Any you lads know where I can get some pingas? ",
"Oi some cunt came up to me the other day asking for two dollars so he could get the train to centerlink, I told the cunt to fuck off. ",
"Fucking houso faggots. ",
"Rove McManus and Peter Helliar, funniest cunts to ever live. ",
"I saw your dad at the Sydney mardi gras this year mate. He looked pretty good. ",
"Absolute fuckwit. ",
"I know plenty of muslims, they're all tip-top blokes. ",
"By the way, learn to fucking spell words right you stupid fucking burger. It's \"colour\". ",
"You bloody freckle fucker. ",
"Give me a home among the gum trees. ",
"All of my kek. ",
"I am, right this instant, having a sick fucking bat. ",
"You being smart, cunt? ",
"Where's me farken durries? ",
"Get out of it you bloody brown-eye bandit. ",
"I'm fucking ridgy-didge mate, not like you. ",
"Haha, what the fuck did you just say to me, you little poof? ",
"You're as boring as batshit. ",
"You're so cheap you wouldn't shout if a shark bit you. ",
"Oi, treat em mean, keep em keen, am I right fellas? ",
"Bloody billy-can dodger. ",
"You've got a face like 50 miles of bad road. ",
"What do you even need a gun for? We have police for a reason. ",
"\n>He's never even sat by a billabong under the shade of a coolabah tree.\n\n",
"\n>laughinganimegirls.jpg\n\n",
"Oi you see that sheilah on Home and Away last night? Yeah she's alright ey. ",
"**Moderator's Note**\n\nThis post is locked to prevent inappropriate edits to its content. The post looks exactly as it is supposed to look - there are no problems with its content. Please do not flag it for our attention.",
"```\n            AAA                    AAA                    AAA          AAAAA  AAAAA\n           AAAAA                  AAAAA                  AAAAA         AAAAA  AAAAA\n          AAA AAA                AAA AAA                AAA AAA        AAAAA  AAAAA\n         AAA   AAA              AAA   AAA              AAA   AAA       AAAAA  AAAAA\n        AAA     AAA            AAA     AAA            AAA     AAA       AAA    AAA\n       AAAAAAAAAAAAA          AAAAAAAAAAAAA          AAAAAAAAAAAAA      AAA    AAA\n      AAA         AAA        AAA         AAA        AAA         AAA      \n     AAA           AAA      AAA           AAA      AAA           AAA    AAA    AAA\n    AAA             AAA    AAA             AAA    AAA             AAA  AAAAA  AAAAA\n   AAA               AAA  AAA               AAA  AAA               AAA  AAA    AAA\n```"
]