{"What nation was bounced from the Organisation of American States in 1962?":"cuba","What continent has the fewest flowering plants?":"antarctica","What element begins with the letter “K”?":"krypton","What country saw a world record 315 million voters turn out for elections on May 20, 1991?":"india","What national holiday in Mexico has picnickers munching chocolate coffins and sugar skulls?":"the day of the dead","What nation’s military attached dynamite packs to Dobermans before sending them into Palestinian guerrilla hideouts?":"israel","What was the first planet to be discovered using the telescope, in 1781?":"uranus","How many days does a cat usually stay in heat?":"five","How many U.S. states border the Gulf of Mexico?":"five","What’s the ballet term for a 360-degree turn on one foot?":"pirouette","What did blind bank robber David Worrell use as a weapon when trying to rob a London bank?":"his cane","What Great Lake state has more shoreline than the entire U.S. Atlantic seaboard?":"michigan","What model appeared topless on the self-penned 1993 novel Pirate?":"fabio","If you had Lafite-Rothschild on your dinner table, what would it be?":"wine","What is sushi traditionally wrapped in?":"edible seaweed","May Queen, Wisley Crab, Foxwhelps and Lane’s Prince Albert are all species of what?":"apples","What is allspice alternatively known as?":"pimento","What colour is Absynth?":"green","What flavour is Cointreau?":"orange","What was the most watched UK TV programme of all time?":"eastenders, when den divorced angie, which drew 3010 million viewers on 25th december, 1986","Phyllis Nan Sortain Pechey was as famous for her flamboyant character as for her cookery books and TV show throughout the late 1960s to the mid 1970s. By what name was she more usually known?":"fanny cradock","Which popular BBC series about old collectibles began in 1977, presented by Bruce Parker and Arthur Negus, and is still running to this day?":"antiques roadshow","Which BBC music programme was broadcast weekly between 1964 and 2006?":"top of the pops","Alastair Burnett, Sandy Gall, Reginald Bosanquet, Alastair Stewart, Carol Barnes and Trevor McDonald were all regular presenters of which TV programme?":"itv news at ten","Which country has more tractors per capita, Canada, Iceland or Japan?":"iceland","Who averaged one patent for every three weeks of his life?":"thomas edison","What Elton John album became the first album to enter the charts at Number One, in 1975?":"captain fantastic and the brown dirt cowboy","What laundry detergent got lots of mileage out of the ad line, “ring around the collar”?":"wisk","Who, after anchoring off Hawaii in 1779, was mistaken for the god Lono?":"captain james cook","What continent is cut into two fairly equal halves by the Tropic of Capricorn?":"australia","What explorer introduced pigs to North America?":"christopher columbus","What magazine boasts the slogan: “Test, Inform, Protect”?":"consumer reports","Who was billed as the “Killer of Custer” in Buffalo Bill’s Wild West Show?":"sitting bull","What railway linked Moscow and Irkutsk in 1900?":"the trans-siberian railway","What is the minimum number of musicians a band must have to be considered a “big band”?":"ten","What’s a water moccasin often called, due to the white inside its mouth?":"a cottonmouth","What duo survived a 1909 shootout with Bolivia’s cavalry, according to historians?":"butch cassidy and the sundance kid","What F-word is defined in physics as a “nuclear reaction in which nuclei combine to form more massive nuclei”?":"fusion","What’s the largest and densest of the four rocky planets?":"earth","What ingredient in fresh milk is eventually devoured by bacteria, causing the sour taste?":"lactose","Who offered insurance against an accidental death caused by a falling Sputnik?":"lloyds of london","Which is the only American state to begin with the letter ‘p’?":"pennsylvania","Name the world’s biggest island.":"greenland","What is the world’s longest river?":"amazon","Name the world’s largest ocean.":"pacific","What is the diameter of Earth?":"8,000 miles","Where would you find the world’s most ancient forest?":"daintree forest, north of cairns, australia","Which four British cities have underground rail systems?":"liverpool, glasgow, newcastle and london","What is the capital city of Spain?":"madrid","Which country is Prague in?":"czech republic","What nationality was Chopin?":"polish","What's the best known artificial international language?":"esperanto","Who lived at 221B, Baker Street, London?":"sherlock holmes","Who cut Van Gogh's ear?":"he did","Where did Salvador Dali live?":"figueras","Who painted the Mona Lisa?":"leonardo da vinci","What Spanish artist said he would eat his wife when she died?":"dali","Who wrote Julius Caesar, Macbeth and Hamlet?":"shakespeare","Who wrote Lazarillo de Tormes?":"anonymous","What did the crocodile swallow in Peter Pan?":"alarm clock","Where was Lope de Vega born?":"madrid","What are the first three words of the bible?":"in the beginning","What did the 7 dwarves do for a job?":"miners","Who painted the Sistine Chapel?":"michelangelo","Who wrote La Colmena?":"cela","Name a famous detective who smoked a pipe and played the violin.":"sherlock holmes","How many people went onto Noah's Ark?":"none, because it never existed","What was the name of Don Quijote's horse?":"rocinante","Who was Robin Hood's girlfriend?":"maid marian","Who wrote the James Bond books?":"ian fleming","Who wrote Dr. Jekyll and Mr. Hyde?":"robert louis stevenson","Who said, \"I think, therefore I am\"?":"descartes","Who wrote the Ugly Duckling?":"hans christian andersen","Where was El Greco born?":"greece","What's the Hungarian word for pepper?":"paprika","Which painter did the group Mecano write a song about?":"dali","Who wrote the Satanic Verses?":"salman rushdie","What was the first theatre play in Spain?":"la celestina","What's the most important book in the Moslem religion?":"koran","When was Elvis' first ever concert?":"1954","Who sang \"My Way\"?":"frank sinatra","Who as the main actor in \"Cocktail\"?":"tom cruise","Who was the main actor in Superman 2?":"christopher reeve","Who did Madonna marry?":"sean penn","Who sang, \"I'm dreaming of a white Christmas\"?":"bing crosby","Name the two main actors in \"The Sting\".":"paul newman and robert redford","What year did Elvis Presley die?":"1977","What film star who was in 9« weeks is now a boxer?":"mickey rourke","Who were the two main actors in \"Pretty Woman\"?":"julia roberts and richard gere","Name two actors who played James Bond. (Sean Connery, George Lazenby,":"timothy dalton, pierce brosnan","Who was the director of the film \"Psycho\"?":"alfred hitchcock","In which city is Hollywood?":"los angeles","Who did John Lennon marry?":"yoko ono","Name three of the beatles":"ringo starr, john lennon, paul mccartney, george harrison","Which 2 actors were in \"Gone with the wind\"?":"clark gable and vivien leigh","Who wrote the song \"Johnny be good\"?":"chuck berry","What was the first film with sound?":"the jazz singer","How many oscars did Alfred Hitchcock win?":"none","Which film about Germany won most prizes in 1976?":"cabaret","What year did the drummer of Def Lepperd loose his arm?":"1984","Where are the Dolomites?":"italy","What's the capital of Kenya?":"nairobi","Which is the largest ocean?":"pacific","What's the capital of Honduras?":"tegucigarpa","What's the capital of Ethiopia?":"addis ababa","What's the capital of Ecuador?":"quito","What's the smallest country in the world?":"vatican city","What is the capital of Australia?":"canberra","What's the largest city in India?":"bombay","How many avenues radiate from the Arc de Triomphe in Paris?":"12","What's the capital of Denmark?":"copenhagen","What's the capital of Brazil?":"brasilia","Which river goes through London?":"thames","What's the highest mountain in Africa?":"kilimanjaro","What's the capital of Finland?":"helsinki","Where is Mulhacen?":"granada spain","How many states are there in the United States of America?":"50","Which river passes through Madrid?":"manzanares","Which German city is famous for the perfume it produces?":"cologne","What's the capital of Monaco?":"monaco","Which is Britain's second largest city?":"birmingham","What is 15 metres high, 8 metres wide and 240 kilometers long?":"wall","What's the highest mountain in the world?":"everest","What's the capital of Scotland?":"edinburgh","Which country has the largest area: Australia, Brazil or India?":"brazil","Where are the Luxembourg Gardens?":"paris","Which mountains are between Spain and France?":"pyrenees","Which is the smallest ocean?":"artic","How many wives did Henry the Eighth have?":"six","Where was Franco born?":"teruel","When did the first man go into space?":"1961","Who was the first man in space?":"gagarin","Where did the first atomic bomb explode for the first time in Japan?":"hiroshima","Who said, \"Vini, vidi, vici\"?":"caesar","What year did Christopher Columbus go to America?":"1492","Who did Lady Diana Spencer marry?":"prince charles","Who did Prince Rainier of Monaco marry?":"grace kelly","What year did the Spanish Civil War end?":"1939","When did the First World War start?":"1914","When did the Second World War end?":"1945","Can Queen Elizabeth the Second vote?":"no","Who was the first president of America?":"washington","Who did Franco designate as his successor in 1969?":"juan carlos","How many fingers did Ann Boleyn have?":"11","Who was Felipe el Hermoso's wife?":"juana la loca","Did Neil Armstrong put his l. or his r. foot on the moon first?":"left","What year did King Juan Carlos get married?":"1962","In what decade was the last execution at the Tower of London?":"1940s","When did the Americans leave Vietnam?":"1973","Who was the first man on the moon?":"armstrong","What religion was Adolf Hitler?":"catholic","Where was Marco Polo's home town?":"venice","Which Italian leader was terribly afraid of the evil eye?":"mussolini","How many children has Queen Elizabeth the Second got?":"4","What's the real name of Siddartha Gautama?":"buddha","What's the name of the famous big clock in London?":"big ben","Where was Christopher Columbus born?":"genoa","When did the American Civil War end?":"1865","What country gave Florida to the USA in 1891?":"spain","Who gave his name to the month of July?":"julius caesar","What did the Montgolfier brothers invent?":"the balloon","Who is the president of Iraq?":"sadam hussein","When was President Kennedy killed?":"1963","What stopped in London at 3.45 on August 5th, 1975?":"big ben","What nationality was Marco Polo?":"italian","Who won a gold medal for Spain in cycling in the 1992 Olympics?":"jose manuel moreno","Who is the tallest basketball player in the world?":"manute boll","What do you use to take a cork out of a bottle?":"a corkscrew","What language has the most words?":"english","What's the name of the main airport in Madrid?":"barajas","What money do they use in Japan?":"yen","What year did Paquirri die?":"1984 or 1985","Where does the American president live?":"the white house","What is the first letter on a typewriter?":"q","What do the opposite sides of a dice add up to?":"7","Which fast food restaurants were established by Ray Kroc?":"mcdondalds","How long is a round in boxing?":"3 minutes","Who is the Prime Minister of Britain?":"john major","What's the highest score in a gymnastics exercise?":"10","What time do the pubs normally close in England?":"11 o'clock","How many months have 31 days?":"7","How many eyes are there on a pack of 52 cards?":"42","What is the main language in Albania?":"tosco","What's the fastest passenger plane in the world?":"concorde","What are the Sun, the Independent and the Guardian?":"newspapers","How many coloured balls are there in billiards?":"15","What's the longest word in Spanish?":"superextraordinarissimo","How many players are there in a basketball team?":"5","Which is the most spoken language?":"chinese","How many lanes does an olympic swimming pool have?":"8","In what language does \"obrigado\" mean \"thank you\"?":"portuguese","How many squares are there on a chess board?":"64","How many prongs are there on a fork?":"4","Who starts first in chess?":"white","How many events are there in the decathlon?":"10","What activity other than jumping are kangaroos good at?":"boxing","How many players are there in a volleyball team?":"6","What are the five colours of the Olympic rings?":"r,y,g,blue black","Where are the most expensive seats at a bullfight?":"in the shade","Who named a perfume for her fashion shows on the 5th day of the month?":"chanel","How many dots are there on two dice?":"42","What horoscope sign has a crab?":"cancer","In which shop can you buy books in England?":"bookshop","Where does the British Prime Minister live?":"10, downing street","How long is the compulsory military service in England?":"it doesn't exist","What does the female praying mantis do after she's made love?":"eats the male","How many colours are there in a rainbow?":"7","How many legs has a spider got?":"8","What are the three primary colours?":"red, blue and yellow","What type of elephant has got the biggest ears?":"african","Who invented the electric light bulb?":"thomas edison","Who invented the telephone?":"bell","Which nail grows fastest?":"middle","What temperature does water boil at?":"100c","Who discovered penicillin?":"fleming","What did Joseph Priesley discover in 1774?":"oxygen","Where is the smallest bone in the body?":"ear","Which is the only mammal that can't jump?":"elephant","What does the roman numeral C represent?":"100","What colour is a panda?":"black and white","What's the smallest type of tree in the world?":"bonsai","Who invented television?":"john logie baird","Who said E=mc2":"einstein","Which planet is nearest the sun?":"mercury","What colours make purple?":"red and blue","What's the hardest rock?":"diamond","How much does a litre of water weigh?":"1kg","Pho is a popular noodle soup from what country?":"vietnam","Who designed and built the Pascaline?":"blaise pascal","Madagascar is an island located of the southeast coast of what continent?":"africa","What is the medical term for bad breath?":"halitosis","Cruella de Vil is a character who appeared in what novel by Dodie Smith?":"the hundred and one dalmatians","What was the name of The Lone Ranger's horse that he saved from an enraged buffalo?":"silver","The Pascaline, invented by Blaise Pascal in the early 17th century, was a mechanical type of what device?":"calculator","Lake Tahoe straddles the border between which two U.S. states?":"california & nevada","How do you say \"hello\" in Swedish?":"hej","The Kangaroo Hoppet is a long distance cross-country skiing race that is held in which county?":"australia","Frankenmuth, a U.S. city nicknamed \"Little Bavaria\", is located in what state?":"michigan","In what year was the Declaration of Independence created?":"1776","What year was Facebook founded?":"2004","What are baby beavers called?":"kittens or kits","What is the fastest land snake in the world?":"black mamba","What is the scientific name of the common potato?":"solanum tuberosum l","How many elevators does the Empire State Building have?":"73","Callisto is the name of a moon orbiting what planet in our solar system?":"jupiter","What was the name of Michael Jackson's first solo album as an adult?":"off the wall","Nicholas II, the last Tsar of Russia was said to have been close friends with a mystical faith healer known by what name?":"grigori rasputin"}