["Well looky what we have here. No no no, you're staying right here with me. Never mind that, never mind that now, never mind that, never mind- I still don't understand, how am I supposed to go to the dance with her, if she's already going to the dance with you. I followed you. Yeah, you got my homework finished, McFly?","Why that's me, look at me, I'm an old man. Who? Give me a hand, Lorenzo. Ow, dammit, man, I sliced my hand. Who are you calling spook, pecker-wood. Where does he come from?","Oh, I've been so worried about you ever since you ran off the other night. Are you okay? I'm sorry I have to go. Isn't he a dream boat? Look at the time, you've got less than 4 minutes, please hurry. Yeah well, I saw it on a rerun. Yeah, yeah what are you wearing, Dave. Keys?","Well, ma, we talked about this, we're not gonna go to the lake, the car's wrecked. Are those my clocks I hear? Well, Biff. Don't worry, I'll take care of the lightning, you take care of your pop. By the way, what happened today, did he ask her out? Let's put him in there.","Look at the time, you've got less than 4 minutes, please hurry. The flux capacitor. That's a great idea. I'd love to park. What you got under here? Right.","Let's get him. You bet. Dear Doctor Brown, on the night that I go back in time, you will be shot by terrorists. Please take whatever precautions are necessary to prevent this terrible disaster. Your friend, Marty. Your not gonna be picking a fight, Dad, dad dad daddy-o. You're coming to a rescue, right? Okay, let's go over the plan again. 8:55, where are you gonna be. Hey, don't I know you from somewhere?","Never? C'mon, c'mon. This is uh, this is heavy duty, Doc, this is great. Uh, does it run on regular unleaded gasoline? And Jack Benny is secretary of the Treasury. Don't pay any attention to him, he's in one of his moods. Sam, quit fiddling with that thing, come in here to dinner. Now let's see, you already know Lorraine, this is Milton, this is Sally, that's Toby, and over there in the playpen is little baby Joey.","Mom, is that you? Okay, that's enough. Now stop the microphone. I'm sorry fellas. I'm afraid you're just too darn loud. Next, please. Where's the next group, please. No sir, I'm gonna make something out of myself, I'm going to night school and one day I'm gonna be somebody. Don't tell me anything. Yeah, he's right here.","Right, and where am I gonna be? Give me a hand, Lorenzo. Ow, dammit, man, I sliced my hand. Hey Marty, I'm not your answering service, but you're outside pouting about the car, Jennifer Parker called you twice. Doc, wait. No, bastards. Okay, okay you guys, oh ha ha ha very funny. Hey you guys are being real mature.","Alright, punk, now- Save the clock tower, save the clock tower. Mayor Wilson is sponsoring an initiative to replace that clock. Thirty years ago, lightning struck that clock tower and the clock hasn't run since. We at the Hill Valley Preservation Society think it should be preserved exactly the way it is as part of our history and heritage. Its good. C'mon, he's not that bad. At least he's letting you borrow the car tomorrow night. Last night, Darth Vader came down from planet Vulcan. And he told me that if I didn't take Lorraine, that he'd melt my brain.","Uncle Jailbird Joey? Because, you might regret it later in life. Good evening, I'm Doctor Emmett Brown. I'm standing on the parking lot of Twin Pines Mall. It's Saturday morning, October 26, 1985, 1:18 a.m. and this is temporal experiment number one. C'mon, Einy, hey hey boy, get in there, that a boy, in you go, get down, that's it. George, buddy. remember that girl I introduced you to, Lorraine. What are you writing? Hey, don't I know you from somewhere?","Not a word, not a word, not a word now. Quiet, uh, donations, you want me to make a donation to the coast guard youth auxiliary? Don't tell me. Uh, you want me to buy a subscription to the Saturday Evening Post? His head's gone, it's like it's been erased. Its good. Well, it will just happen. Like the way I met your father.","Hey Biff, check out this guy's life preserver, dork thinks he's gonna drown. Well, it will just happen. Like the way I met your father. Look, I'm just not ready to ask Lorraine out to the dance, and not you, nor anybody else on this planet is gonna make me change my mind. I will. I have to tell you about the future.","Oh, great scott. You get the cable, I'll throw the rope down to you. Well that's your name, isn't it? Calvin Klein. it's written all over your underwear. Oh, I guess they call you Cal, huh? The only way we're gonna get those two to successfully meet is if they're alone together. So you've got to get your father and mother to interact at some sort of social- I hope so. Hey boy, are you alright?","So tell me, future boy, who's president of the United States in 1985? Uh, look me up when you get there. Well that's your name, isn't it? Calvin Klein. it's written all over your underwear. Oh, I guess they call you Cal, huh? You extol me with a lot of confidence, Doc. Um, well it's a delorean, right?","My god, they found me. I don't know how but they found me. Run for it, Marty. My god, they found me. I don't know how but they found me. Run for it, Marty. No. Alright, c'mon, I think we're safe. Hey Dad, George, hey, you on the bike. We're gonna take a little break but we'll be back in a while so, don't nobody go no where.","I'd like you to meet my good friend George McFly. Please, Marty, don't tell me, no man should know too much about their own destiny. We all make mistakes in life, children No, I refuse to except the responsibility. Are those my clocks I hear?","No, no, George, look, it's just an act, right? Okay, so 9:00 you're strolling through the parking lot, you see us struggling in the car, you walk up, you open the door and you say, your line, George. Marty, why are you so nervous? No, why, what's a matter? The car, Dad, I mean He wrecked it, totaled it. I needed that car tomorrow night, Dad, I mean do you have any idea how important this was, do you have any clue? Welcome to my latest experiment. It's the one I've been waiting for all my life.","No. Thanks a lot, kid. I just wanna use the phone. Mayor Goldie Wilson, I like the sound of that. Hey kid, what you do, jump ship?","Doc, wait. No, bastards. Biff, stop it. Biff, you're breaking his arm. Biff, stop. You'll find out in thirty years. You know what I do in those situations? Biff.","Ahh. I think you got the wrong car, McFly. Get your meat hooks off of me. So what's it to you, butthead. You know you've been looking for a, since you're new here, I'm gonna cut you a break, today. So why don't you make like a tree, and get out of here. You want it, you know you want it, and you know you want me to give it to you.","Something that really cooks. Alright, alright this is an oldie, but uh, it's an oldie where I come from. Alright guys, let's do some blues riff in b, watch me for the changes, and uh, try and keep up, okay. Wrecked? When did this happen and- Who the hell is John F. Kennedy? What, what? whoa, this is it, this is the part coming up, Doc.","Marty, is that you? Never? Biff, stop it. Biff, you're breaking his arm. Biff, stop. That's Strickland. Jesus, didn't that guy ever have hair? His head's gone, it's like it's been erased.","What did you say? I'm too loud. I can't believe it. I'm never gonna get a chance to play in front of anybody. Doc? Well, it will just happen. Like the way I met your father. I'm, I'm sorry, Mr. McFly, I mean, I was just starting on the second coat.","Uh, no, no, no, no. What are you looking at, butt-head? Yeah, well history is gonna change. Mr. McFly, Mr. McFly, this just arrived, oh hi Marty. I think it's your new book. What was it, George, bird watching? Keys?","George, buddy. remember that girl I introduced you to, Lorraine. What are you writing? This Saturday night, mostly clear, with some scattered clouds. Lows in the upper forties. Watch this. Not me, the car, the car. My calculations are correct, when this baby hits eighty-eight miles per hour, your gonna see some serious shit. Watch this, watch this. Ha, what did I tell you, eighty-eight miles per hour. The temporal displacement occurred at exactly 1:20 a.m. and zero seconds. What, I don't get what happened. Sit here, Marty.","What's going on? Where have you been all week? Good, there's somebody I'd like you to meet. Lorraine. No, Biff, you leave her alone. Good morning, Mom. Right. Lou, gimme a milk, chocolate. Lorraine, my density has popped me to you.","Now, now, Biff, now, I never noticed any blindspot before when I would drive it. Hi, son. Keys? What? Unroll their fire. My name's Lorraine, Lorraine Baines.","What do you mean you've seen this, it's brand new. It's taken me almost thirty years and my entire family fortune to realize the vision of that day, my god has it been that long. Things have certainly changed around here. I remember when this was all farmland as far as the eye could see. Old man Peabody, owned all of this. He had this crazy idea about breeding pine trees. No wait, Doc, the bruise, the bruise on your head, I know how that happened, you told me the whole story. you were standing on your toilet and you were hanging a clock, and you fell, and you hit your head on the sink, and that's when you came up with the idea for the flux capacitor, which makes time travel possible. Perfect, just perfect. This sounds pretty heavy.","Biff. It's a board with wheels. No, get out of town, my mom thinks I'm going camping with the guys. Well, Jennifer, my mother would freak out if she knew I was going up there with you. And I get this standard lecture about how she never did that kind of stuff when she was a kid. Now look, I think she was born a nun. Like I always told you, if you put your mind to it you could accomplish anything. Just turn around, McFly, and walk away. Are you deaf, McFly? Close the door and beat it.","Why not? I can't believe you loaned me a car, without telling me it had a blindspot. I could've been killed. Jesus, you smoke too? No no. Lorraine, Lorraine, what are you doing? Um, yeah, I'm on my way.","Which one's your pop? Calvin, why do you keep calling me Calvin? Hello. You got a real attitude problem, McFly. You're a slacker. You remind me of you father when he went her, he was a slacker too. Hey wait, wait a minute, who are you? Stella, another one of these damn kids jumped in front of my car. Come on out here, help me take him in the house.","Doc. Well, Marty, I want to thank you for all your good advise, I'll never forget it. Oh, what I meant to day was- Marty, that was very interesting music. Okay Doc, this is it.","Really. Like I always told you, if you put your mind to it you could accomplish anything. It works, ha ha ha ha, it works. I finally invent something that works. Don't worry, I'll take care of the lightning, you take care of your pop. By the way, what happened today, did he ask her out? Okay, alright, Saturday is good, Saturday's good, I could spend a week in 1955. I could hang out, you could show me around.","Biff, stop it. Biff, you're breaking his arm. Biff, stop. Hey, Doc, we better back up, we don't have enough roads to get up to 88. Jennifer, oh are you a sight for sore eyes. Let me look at you. C'mon man, let's do something that really cooks. You want it, you know you want it, and you know you want me to give it to you.","Uh, well, okay Biff, uh, I'll finish that on up tonight and I'll bring it over first thing tomorrow morning. Save the clock tower, save the clock tower. Mayor Wilson is sponsoring an initiative to replace that clock. Thirty years ago, lightning struck that clock tower and the clock hasn't run since. We at the Hill Valley Preservation Society think it should be preserved exactly the way it is as part of our history and heritage. Uh listen, do you know where Riverside Drive is? Hey, George, buddy, you weren't at school, what have you been doing all day? This is uh, this is heavy duty, Doc, this is great. Uh, does it run on regular unleaded gasoline?","Wait a minute, Doc. What are you talking about? What happens to us in the future? What do we become assholes or something? Does your mom know about tomorrow night? Sit here, Marty. Never? Why not?","Excuse me. That's good advice, Marty. Doc, she didn't even look at him. Now which one was it, Greg or Craig? Yeah, sure, okay.","Evening, Doctor Brown, what's with the wire? Yet. Marty. Marty. Marty. So tell me, future boy, who's president of the United States in 1985? I've gotta go.","You know, Doc, you left your equipment on all week. Hey man, the dance is over. Unless you know someone else who could play the guitar. What did you sleep in your clothes again last night. Okay. I think I know exactly what you mean.","Good, I'll see you tonight. Don't forget, now, 1:15 a.m., Twin Pines Mall. Uh Doc, uh no. No, don't be silly. Hey man, look at Marvin's hand. He can't play with his hands like that, and we can't play without him. Oh, oh a rematch, why, were you cheating? Hey you, get your damn hands off, oh.","Well that's your name, isn't it? Calvin Klein. it's written all over your underwear. Oh, I guess they call you Cal, huh? He's a peeping tom. Dad. This is more serious than I thought. Apparently your mother is amorously infatuated with you instead of your father. Where? So what's it to you, butthead. You know you've been looking for a, since you're new here, I'm gonna cut you a break, today. So why don't you make like a tree, and get out of here.","Next, please. Next, please. Yeah, I guessed you're a sailor, aren't you, that's why you wear that life preserver. Just relax now Calvin, you've got a big bruise on you're head. That's George McFly?","I don't wanna see you in here again. Keys? Ahh. Because, you might regret it later in life. McFly.","Now which one was it, Greg or Craig? Okay. George McFly? Oh, he's kinda cute and all, but, well, I think a man should be strong, so he could stand up for himself, and protect the woman he loves. Don't you? Yeah, it's 8:00. Now Biff, don't con me.","George: you ever think of running for class president? Radiation suit, of course, cause all of the fall out from the atomic wars. This is truly amazing, a portable television studio. No wonder your president has to be an actor, he's gotta look good on television. Really. No, bastards. I do understand. If I know too much about my own future I could endanger my own existence, just as you endangered yours.","Quiet, quiet. I'm gonna read your thoughts. Let's see now, you've come from a great distance? Hey, Doc, we better back up, we don't have enough roads to get up to 88. Alright, I'm ready. Yeah well look, Marvin, Marvin, you gotta play. See that's where they kiss for the first time on the dance floor. And if there's no music, they can't dance, and if they can't dance, they can't kiss, and if they can't kiss, they can't fall in love and I'm history. Doc? Am I to understand you're still hanging around with Doctor Emmett Brown, McFly? Tardy slip for you, Miss Parker. And one for you McFly I believe that makes four in a row. Now let me give you a nickle's worth of advice, young man. This so called Doctor Brown is dangerous, he's a real nuttcase. You hang around with him you're gonna end up in big trouble.","Well, she's not doing a very good job. I have to tell you about the future. Uh, Lorraine. How did you know I was here? Don't worry. As long as you hit that wire with the connecting hook at precisely 88 miles per hour, the instance the lightning strikes the tower, everything will be fine. No no no, Doc, I just got here, okay, Jennifer's here, we're gonna take the new truck for a spin.","It's about the future, isn't it? C'mon, more, dammit. Jeez. Holy shit. Let's see if you bastards can do ninety. Yoo. Marty, this may seem a little foreward, but I was wondering if you would ask me to the Enchantment Under The Sea Dance on Saturday. My equipment, that reminds me, Marty, you better not hook up to the amplifier. There's a slight possibility for overload.","C'mon, c'mon. Good evening, I'm Doctor Emmet Brown, I'm standing here on the parking lot of- Whoa, whoa, okay. Hello, Jennifer. Right, George. Well, good luck you guys. Oh, one other thing, if you guys ever have kids and one of them when he's eight years old, accidentally sets fire to the living room rug, be easy on him.","Well, she's not doing a very good job. Ah well, sort of. C'mon. Radiation suit, of course, cause all of the fall out from the atomic wars. This is truly amazing, a portable television studio. No wonder your president has to be an actor, he's gotta look good on television. No no no no no, Marty, both you and Jennifer turn out fine. It's your kids, Marty, something has got to be done about your kids.","Lorenzo, where're you keys? Brown, Brown, Brown, Brown, Brown, great, you're alive. Do you know where 1640 Riverside- Marty, you're acting like you haven't seen me in a week. Marty. Marty. Marty. She's just trying to keep you respectable.","Thank you, don't forget to take a flyer. George. What the hell is a gigawatt? Erased from existence. Ahh.","George, aren't you gonna kiss me? How's your head? Look, I'm just not ready to ask Lorraine out to the dance, and not you, nor anybody else on this planet is gonna make me change my mind. Ah, where're my pants? Last night, Darth Vader came down from planet Vulcan. And he told me that if I didn't take Lorraine, that he'd melt my brain.","What do you mean you've seen this, it's brand new. Marty, one rejection isn't the end of the world. Well, she's not doing a very good job. Well, aren't you going up to the lake tonight, you've been planning it for two weeks. That's George McFly?","Doc, wait. No, bastards. Marty, you're acting like you haven't seen me in a week. C'mon, Mom, make it fast, I'll miss my bus. Hey see you tonight, Pop. Woo, time to change that oil. Hey man, the dance is over. Unless you know someone else who could play the guitar. George McFly? Oh, he's kinda cute and all, but, well, I think a man should be strong, so he could stand up for himself, and protect the woman he loves. Don't you?","I hope you don't mind but George asked if he could take me home. Hey man, look at Marvin's hand. He can't play with his hands like that, and we can't play without him. You extol me with a lot of confidence, Doc. Alright kid, you stick to your father like glue and make sure that he takes her to the dance. I don't wanna see you in here again.","George: you ever think of running for class president? Jesus, George, it's a wonder I was ever born. I'll call you tonight. Calm down, Marty, I didn't disintegrate anything. The molecular structure of Einstein and the car are completely intact. Oh, hi , Marty. I didn't hear you come in. Fascinating device, this video unit.","He's your brother, Mom. You bet. Einstein, hey Einstein, where's the Doc, boy, huh? Doc Quiet. Brown, Brown, Brown, Brown, Brown, great, you're alive. Do you know where 1640 Riverside-","Well, this is a radiation suit. Please note that Einstein's clock is in complete synchronization with my control watch. Oh, hi , Marty. I didn't hear you come in. Fascinating device, this video unit. Good, you could start by sweeping the floor. I have a feeling too.","Anyway, Grandpa hit him with the car and brought him into the house. He seemed so helpless, like a little lost puppy, my heart just went out for him. Whoa, whoa, kid, kid, stop, stop, stop, stop. You know Marty, I'm gonna be very sad to see you go. You've really mad a difference in my life, you've given me something to shoot for. Just knowing, that I'm gonna be around to se 1985, that I'm gonna succeed in this. That I'm gonna have a chance to travel through time. It's going to be really hard waiting 30 years before I could talk to you about everything that's happened in the past few days. I'm really gonna miss you, Marty. No no no this sucker's electrical, but I need a nuclear reaction to generate the one point twenty-one gigawatts of electricity- Okay, okay you guys, oh ha ha ha very funny. Hey you guys are being real mature.","Doc, Doc, it's me, Marty. Uh, well, I haven't finished those up yet, but you know I figured since they weren't due till- Will you take care of that? What were you doing in the middle of the street, a kid your age. A colored mayor, that'll be the day.","Well gee, I don't know. It's taken me almost thirty years and my entire family fortune to realize the vision of that day, my god has it been that long. Things have certainly changed around here. I remember when this was all farmland as far as the eye could see. Old man Peabody, owned all of this. He had this crazy idea about breeding pine trees. Look, I'm just not ready to ask Lorraine out to the dance, and not you, nor anybody else on this planet is gonna make me change my mind. Over there, on my hope chest. I've never seen purple underwear before, Calvin. Ah. Whoa.","Children. Good. Have a good trip Einstein, watch your head. Doc, she's beautiful. She's crazy about me. Look at this, look what she wrote me, Doc. That says it all. Doc, you're my only hope. Please note that Einstein's clock is in complete synchronization with my control watch. On the night I go back in time, you get- Doc.","Yeah. My name's Lorraine, Lorraine Baines. Whoa, they really cleaned this place up, looks brand new. Hey beat it, spook, this don't concern you. Yoo.","No. Get your meat hooks off of me. Wait a minute, wait a minute, Doc, are you telling me that you built a time machine out of a delorean. I'm gonna be at the dance. Don't tell me anything.","This Saturday night, mostly clear, with some scattered clouds. Lows in the upper forties. Are you okay? Yeah, it's 8:00. Doc. Yeah.","Yeah. What? Remember, fellas, the future is in your hands. If you believe in progress, re-elect Mayor Red Thomas, progress is his middle name. Mayor Red Thomas's progress platform means more jobs, better education, bigger civic improvements, and lower taxes. On election day, cast your vote for a proven leader, re-elect Mayor Red Thomas... Here you go, lady. There's a quarter. Hey kid, what you do, jump ship?","What the hell is this? Does your mom know about tomorrow night? Say that again. A bolt of lightning, unfortunately, you never know when or where it's ever gonna strike. C'mon.","Hey guys, you gotta get back in there and finish the dance. Where? I'm gonna be at the dance. What? Yeah, yeah what are you wearing, Dave.","Hey, George, buddy, you weren't at school, what have you been doing all day? What, I don't get what happened. Yeah, I think it's a major embarrassment having an uncle in prison. Now remember, according to my theory you interfered with with your parent's first meeting. They don't meet, they don't fall in love, they won't get married and they wont have kids. That's why your older brother's disappeared from that photograph. Your sister will follow and unless you repair the damages, you will be next. I know, and all I could say is I'm sorry.","Yeah, well uh, lets keep this brain melting stuff to ourselves, okay? Huh? Oh. Oh, I sure like her, Marty, she is such a sweet girl. Isn't tonight the night of the big date? Doc, wait. No, bastards.","Good evening, I'm Doctor Emmet Brown, I'm standing here on the parking lot of- Well, they're your parents, you must know them. What are their common interests, what do they like to do together? George, buddy. remember that girl I introduced you to, Lorraine. What are you writing? Oh. Why am I always the last one to know about these things.","I think it's terrible. Girls chasing boys. When I was your age I never chased a boy, or called a boy, or sat in a parked car with a boy. No no. Lorraine, Lorraine, what are you doing? Now which one was it, Greg or Craig? Quiet, quiet. I'm gonna read your thoughts. Let's see now, you've come from a great distance? Alright, punk, now-","Biff. Unroll their fire. Alright, I'm ready. There, there, now, just relax. You've been asleep for almost nine hours now. It's taken me almost thirty years and my entire family fortune to realize the vision of that day, my god has it been that long. Things have certainly changed around here. I remember when this was all farmland as far as the eye could see. Old man Peabody, owned all of this. He had this crazy idea about breeding pine trees.","I will. Last night, Darth Vader came down from planet Vulcan. And he told me that if I didn't take Lorraine, that he'd melt my brain. You cost three-hundred buck damage to my car, you son-of-a-bitch. And I'm gonna take it out of your ass. Hold him. That's good advice, Marty. Hey c'mon, I had to change, you think I'm going back in that zoot suit? The old man really came through it worked.","What you got under here? Does your mom know about tomorrow night? Are you gonna order something, kid? Wait a minute, Doc. What are you talking about? What happens to us in the future? What do we become assholes or something? We do now.","Yeah, it's 8:00. Well, she's not doing a very good job. No, why, what's a matter? What, well you mean like a date? George.","Okay Doc, this is it. Scram, McFly. Uh, stories, science fiction stories, about visitors coming down to Earth from another planet. What? Just turn around, McFly, and walk away. Are you deaf, McFly? Close the door and beat it.","Yeah, I'm- mayor. Now that's a good idea. I could run for mayor. Tab? I can't give you a tab unless you order something. Marty, you interacted with anybody else today, besides me? Why not? Wait a minute.","Your not gonna be picking a fight, Dad, dad dad daddy-o. You're coming to a rescue, right? Okay, let's go over the plan again. 8:55, where are you gonna be. Alright, okay. Alright, there she is, George. Just go in there and invite her. You have this thing hooked up to the car? Biff. Oh yes sir.","I'm too loud. I can't believe it. I'm never gonna get a chance to play in front of anybody. I know what you're gonna say, son, and you're right, you're right, But Biff just happens to be my supervisor, and I'm afraid I'm not very good at confrontations. There, there, now, just relax. You've been asleep for almost nine hours now. Now remember, according to my theory you interfered with with your parent's first meeting. They don't meet, they don't fall in love, they won't get married and they wont have kids. That's why your older brother's disappeared from that photograph. Your sister will follow and unless you repair the damages, you will be next. Thanks.","What, what is it hot? What? Right. I, I don't know. Yeah.","Leave me alone. Um, well it's a delorean, right? What the hell is this? Hey man, the dance is over. Unless you know someone else who could play the guitar. Oh yes sir.","Mr. McFly, Mr. McFly, this just arrived, oh hi Marty. I think it's your new book. Marty, that's completely out of the question, you must not leave this house. you must not see anybody or talk to anybody. Anything you do could have serious reprocautions on future events. Do you understand? Hey, hey, keep rolling, keep rolling there. No, no, no, no, this sucker's electrical. But I need a nuclear reaction to generate the one point twenty-one gigawatts of electricity that I need. Hello. Uh, look me up when you get there.","Who is that guy. I'm telling the truth, Doc, you gotta believe me. I can't believe you loaned me a car, without telling me it had a blindspot. I could've been killed. Leave her alone, you bastard. What did you say?","C'mon. The appropriate question is, weren't the hell are they. Einstein has just become the world's first time traveler. I sent him into the future. One minute into the future to be exact. And at exactly 1:21 a.m. we should cat h up with him and the time machine. Good, I'll see you tonight. Don't forget, now, 1:15 a.m., Twin Pines Mall. Hey, hey, Doc, where are you? What, I don't get what happened.","That's George McFly. This sounds pretty heavy. Listen, this is very important, I forgot my video camera, could you stop by my place and pick it up on your way to the mall? Children. You want it, you know you want it, and you know you want me to give it to you.","How about a ride, Mister? Ronald Reagon, the actor? Then who's vice president, Jerry Lewis? I suppose Jane Wymann is the first lady. Why not? Never mind that, never mind that now, never mind that, never mind- Nothing.","I don't wanna know your name. I don't wanna know anything anything about you. I noticed you band is on the roster for dance auditions after school today. Why even bother Mcfly, you haven't got a chance, you're too much like your own man. No McFly ever amounted to anything in the history of Hill Valley. Uh, you mean nobody's asked you? Well, I figured, what the hell. What, I don't get what happened.","Hot, Jesus Christ, Doc. Jesus Christ, Doc, you disintegrated Einstein. Hey I'm talking to you, McFly, you Irish bug. I have to tell you about the future. Jennifer, oh are you a sight for sore eyes. Let me look at you. You cost three-hundred buck damage to my car, you son-of-a-bitch. And I'm gonna take it out of your ass. Hold him.","No. I, I don't know. Doc. Hey George, buddy, hey, I've been looking all over for you. You remember me, the guy who saved your life the other day. It's uh, the other end of town, a block past Maple.","Doc, Doc, it's me, Marty. You'll find out in thirty years. Lorenzo, where're you keys? Like I always told you, if you put your mind to it you could accomplish anything. Ahh.","Okay, but I don't know what to say. Lorraine, have you ever, uh, been in a situation where you know you had to act a certain way but when you got there, you didn't know if you could go through with it? Ahh. Right. Check out that four by four. That is hot. Someday, Jennifer, someday. Wouldn't it be great to take that truck up to the lake. Throw a couple of sleeping bags in the back. Lie out under the stars.","Why is she gonna get angry with you? Thanks. Excuse me. Well, I figured, what the hell. I had a horrible nightmare, dreamed I went back in time, it was terrible.","Why is she gonna get angry with you? Yeah, but I never picked a fight in my entire life. Ah well, sort of. Hot, Jesus Christ, Doc. Jesus Christ, Doc, you disintegrated Einstein. Um, yeah well I might have sort of ran into my parents.","Yeah. Yeah, he's right here. Hey beat it, spook, this don't concern you. Uh, well, actually, I figured since it wasn't due till Monday- Wow, ah Red, you look great. Everything looks great. 1:24, I still got time. Oh my god. No, no not again, c'mon, c'mon. Hey. Libyans.","Take care. Let's get you into a radiation suit, we must prepare to reload. Which one's your pop? Oh, oh Marty, here's you keys. You're all waxed up, ready for tonight. Alright, okay. Alright, there she is, George. Just go in there and invite her.","Look, I'm just not ready to ask Lorraine out to the dance, and not you, nor anybody else on this planet is gonna make me change my mind. Ah, where're my pants? Now that's a risk you'll have to take you're life depends on it. You know Marty, I'm gonna be very sad to see you go. You've really mad a difference in my life, you've given me something to shoot for. Just knowing, that I'm gonna be around to se 1985, that I'm gonna succeed in this. That I'm gonna have a chance to travel through time. It's going to be really hard waiting 30 years before I could talk to you about everything that's happened in the past few days. I'm really gonna miss you, Marty. I've gotta go.","Right. That's a Florence Nightingale effect. It happens in hospitals when nurses fall in love with their patients. Go to it, kid. Welcome to my latest experiment. It's the one I've been waiting for all my life. George, there's nothing to be scared of. All it takes is a little self confidence. You know, if you put your mind to it, you could accomplish anything. Watch this. Not me, the car, the car. My calculations are correct, when this baby hits eighty-eight miles per hour, your gonna see some serious shit. Watch this, watch this. Ha, what did I tell you, eighty-eight miles per hour. The temporal displacement occurred at exactly 1:20 a.m. and zero seconds."]