["Searing meat does not \"seal in\" moisture, and in fact may actually cause meat to lose moisture. Generally, the value in searing meat is that it creates a brown crust with a rich flavor via the Maillard reaction.","Some people believe that food items cooked with wine or liquor will be totally non-alcoholic, because alcohol's low boiling point causes it to evaporate quickly when heated. However, a study found that some of the alcohol remains: 25 percent after one hour of baking or simmering, and 10 percent after two hours; in either case, however, the amount consumed while eating a dish prepared with alcohol will rarely if ever contain sufficient alcohol to cause even low levels of intoxication.","Monosodium glutamate (MSG) has a widespread reputation for triggering migraine headache exacerbations and other symptoms of so-called Chinese restaurant syndrome, but there are no consistent data to support this relationship. Although there have been reports of an MSG-sensitive subset of the population, this has not been demonstrated in placebo-controlled trials.","Sushi does not mean \"raw fish\", and not all sushi includes raw fish. The name sushi refers to any dish including vinegared rice; raw fish is a common inclusion, but not a necessary one. In the traditional form of sushi unique to the Osaka region, all the ingredients are either cooked or cured; raw fish is never used.","Microwave ovens do not cook food from the inside out. Penetration depth of microwaves is dependent on food composition and the frequency, with lower microwave frequencies (longer wavelengths) penetrating further.","Placing metal inside a microwave oven does not damage the oven's electronics. There are, however, other safety-related issues: electrical arcing may occur on pieces of metal not designed for use in a microwave oven, and metal objects may become hot enough to damage food, skin, or the interior of the oven. Metallic objects designed for microwave use can be used in a microwave with no danger; examples include the metalized surfaces used in browning sleeves and pizza-cooking platforms.","The functional principle of a microwave oven is dielectric heating rather than resonance frequencies of water, and microwave ovens can therefore operate at many frequencies. Water molecules are exposed to intense electromagnetic fields in strong non-resonant microwaves to create heat. The 22 GHz resonant frequency of isolated water molecules has a wavelength too short to penetrate common foodstuffs to useful depths. The typical oven frequency of 2.45 GHz was chosen partly due to its ability to penetrate a food object of reasonable size, and partly to avoid interference with communication frequencies in use when microwave ovens became commercially available.","The Twinkie does not have an infinite shelf life; its listed shelf life is approximately 45 days (25 in its original formulation) and generally remains on a store shelf for only 7 to 10 days.","Fortune cookies, despite being associated with Chinese cuisine in the United States, were in fact invented and brought to the U.S. by the Japanese. The cookies are extremely rare in China, where they are seen as symbols of American cuisine.","A standard cup of brewed coffee has more caffeine than a single shot of espresso. The belief that the reverse is true results from espresso having a higher unit volume of caffeine, which is offset by the much larger volume overall of a regular cup of coffee.","It is rarely necessary to wait 24 hours before filing a missing person report; in instances where there is evidence of violence or of an unusual absence, law enforcement agencies in the United States often stress the importance of beginning an investigation promptly. The UK government website says explicitly in large type \"You don't have to wait 24 hours before contacting the police\".","Entrapment law in the United States does not require police officers to identify themselves as police in the case of a sting or other undercover work, and police officers may lie in doing such work. The law is instead specifically concerned with enticing people to commit crimes they would not have considered in the normal course of events.","\"Edelweiss\" is not the national anthem of Austria, but is in fact an original composition created for the musical The Sound of Music. The actual Austrian national anthem is \"Land der Berge, Land am Strome\" (\"Land of the Mountains, Land on the River\").","\"Twinkle Twinkle Little Star\" was not composed by Wolfgang Amadeus Mozart when he was 5 years old; he only composed variations on the tune, which originated from a French folk song, and at the age of 25 or 26.","The historical Buddha was not obese. The \"chubby Buddha\" or \"laughing Buddha\" is a 10th-century Chinese folk hero by the name of Budai. In Chinese Buddhist culture, Budai came to be revered as an incarnation of Maitreya, the Bodhisattva who will become a Buddha to restore Buddhism after the teachings of the historical Buddha, Siddhārtha Gautama, have fallen out of knowledge.","The Buddha is not a god. In early Buddhism, Siddhārtha Gautama possessed no salvific properties and strongly encouraged \"self-reliance, self discipline and individual striving.\" However, in later developments of Mahāyāna Buddhism, notably in the Pure Land (Jìngtǔ) school of Chinese Buddhism, the Amitābha Buddha was thought to be a savior. Through faith in the Amitābha Buddha, one could be reborn in the western Pure Land. Although in Pure Land Buddhism the Buddha is considered a savior, he is still not considered a god in the common understanding of the term.","The forbidden fruit mentioned in the Book of Genesis is commonly assumed to be an apple, and is widely depicted as such in Western art. However, the Bible does not identify what type of fruit it is. The original Hebrew texts mention only tree and fruit. Early Latin translations use the word mali, which can be taken to mean both \"evil\" and \"apple\". German and French artists commonly depict the fruit as an apple from the 12th century onwards, and John Milton's Areopagitica from 1644 explicitly mentions the fruit as an apple. Jewish scholars have suggested that the fruit could have been a grape, a fig, wheat, an apricot or an etrog.","There is no evidence that Jesus was born on December 25. The Bible never claims a date of December 25, but may imply a date closer to September. The fixed date is attributed to Pope Julius the First because in the year 350 CE he declared the twenty-fifth of December the official date of celebration. The date may have initially been chosen to correspond with either the day exactly nine months after Christians believe Jesus to have been conceived, the date of the Roman winter solstice, or one of various ancient winter festivals.","Nowhere in the Bible does it say that exactly three magi came to visit the baby Jesus, nor that they were kings, or rode on camels, or that their names were Casper, Melchior and Balthazar. Matthew 2 has traditionally been combined with Isaiah 60:1–3.","The idea that Mary Magdalene was a prostitute before meeting Jesus is not found anywhere in the Bible. In the Gospel of Luke, there is a passage about a woman with a reputation for sinning (which may well mean prostitution) immediately before the story introducing Mary Magdalene for the first time. The Catholic Church, since Pope Gregory I's time in the 6th century if not before, had historically assumed that the two accounts refer to the same woman, meaning that before her conversion to Christianity Mary Magdalene was a prostitute. But there is no direct evidence from the Bible over such a link, most modern scholars assert that she was most likely not a prostitute, and even the Catholic Church no longer suggests that the two passages from Luke refer to the same person.","Saul of Tarsus is not recorded as having deliberately changed his name in the Acts of the Apostles or elsewhere in the Bible following his conversion experience on the road to Damascus. He was born a Jew with a Roman citizenship inherited from his father, and thus carried both a Hebrew and a Latin name since his birth. He stopped using his Jewish name \"Saul\" (Hebrew: שָׁאוּל, Modern Sha'ul, Tiberian Šāʼûl) and used instead his Roman name \"Paul\" (Latin: Paulus) when he became an international missionary; whether that change was to reflect the new contexts he was in or as a reflection of change in his inward being is not found in the Bible or any contemporaneous sources, and is merely speculative. Luke indicates the coexistence of the names in Acts 13:9: \"...Saul, who also is called Paul...\".","The term \"Immaculate Conception\" was not coined to refer to the virgin birth of Jesus, nor does it reference a supposed belief in the virgin birth of Mary, his mother. Instead, it denotes a Roman Catholic belief that Mary was not in a state of original sin from the moment of her own conception.","Roman Catholic dogma does not say that the pope is either sinless or always infallible. Catholic dogma since 1870 does state that a dogmatic teaching contained in divine revelation that is promulgated by the pope (deliberately, and under certain very specific circumstances) is free from error, although official invocation of papal infallibility is extremely rare, with recent popes finishing their reign without a single invocation. Otherwise, even when speaking in his official capacity, dogma does not hold that he is free from error.","Despite common belief, members of The Church of Jesus Christ of Latter-day Saints (LDS Church) no longer practice polygamy, although it was historically practiced in the LDS Church. Currently, the LDS Church excommunicates any members that practice polygamy within the organization. However, some Mormon fundamentalist sects still practice polygamy within their groups.","A fatwā is a non-binding legal opinion issued by an Islamic scholar under Islamic law; as such, it is commonplace for fatwās from different authors to disagree. The popular misconception that the word means a death sentence probably stems from the fatwā issued by Ayatollah Ruhollah Khomeini of Iran in 1989 regarding the author Salman Rushdie, whom he stated had earned a death sentence for blasphemy. This event led to fatwās gaining widespread media attention in the West.","The word \"jihad\" does not always mean \"holy war\"; literally, the word in Arabic means \"struggle\". While there is such a thing as \"jihad bil saif\", or jihad \"by the sword\", many modern Islamic scholars usually say that it implies an effort or struggle of a spiritual kind. Scholar Louay Safi asserts that \"misconceptions and misunderstandings regarding the nature of war and peace in Islam are widespread in both the Muslim societies and the West\", as much following 9/11 as before.","The Quran does not promise martyrs 72 virgins in heaven. It does mention virgin companions, houri, to all people—martyr or not—in heaven, but no number is specified. The source for the 72 virgins is a hadith in Sunan al-Tirmidhi by Imam Tirmidhi. Hadiths are sayings and acts of the prophet Mohammed as reported by others, and as such they are not part of the Quran itself. Muslims are not meant to necessarily believe all hadiths, and that applies particularly to those hadiths that are weakly sourced, such as this one. Furthermore, the correct translation of this hadith is a matter of debate.","Abner Doubleday did not invent baseball, nor did it originate in Cooperstown, New York. It is believed to have evolved from other bat-and-ball codes such as cricket and rounders and first taken its modern form in New York City. (See Origins of baseball.)","The black belt in martial arts does not necessarily indicate expert level or mastery. It was introduced for judo in the 1880s to indicate competency of all of the basic techniques of the sport. Promotion beyond black belt varies among different martial arts. In judo and some other Asian martial arts, holders of higher ranks are awarded belts with alternating red and white panels, and the highest ranks with solid red belts.","Non-standard, slang or colloquial terms used by English speakers are sometimes alleged not to be real words. For instance, despite appearing as a word in numerous dictionaries, \"irregardless\" is sometimes dismissed as \"not a word\". All words in English became accepted by being commonly used during a certain period of time; thus there are many informal words currently regarded as \"incorrect\" in formal speech or writing. But the idea that they are somehow not words is a misconception. Examples of words that are sometimes alleged not to be words include \"conversate\", \"funnest\", \"mentee\", \"impactful\", and \"thusly\". All of these appear in numerous dictionaries as English words.","The word \"fuck\" did not originate in Christianized Anglo-Saxon England (7th century CE) as an acronym for \"Fornication Under Consent of King\"; nor did it originate as an acronym for \"For Unlawful Carnal Knowledge\", either as a sign posted above adulterers in the stocks, or as a criminal charge against members of the British Armed Forces; nor did it originate during the 15th-century Battle of Agincourt as a corruption of \"pluck yew\" (an idiom falsely attributed to the English for drawing a longbow). Modern English was not spoken until the 16th century, and words such as \"fornication\" and \"consent\" did not exist in any form in English until the influence of Anglo-Norman in the late 12th century. The earliest recorded use of \"fuck\" in English comes from c. 1475, in the poem \"Flen flyys\", where it is spelled fuccant (conjugated as if a Latin verb meaning \"they fuck\"). It is of Proto-Germanic origin, and is related to either Dutch fokken and German ficken or Norwegian fukka.","The word \"crap\" did not originate as a back-formation of British plumber Thomas Crapper's surname, nor does his name originate from the word \"crap\", although the surname may have helped popularize the word. The surname \"Crapper\" is a variant of \"Cropper\", which originally referred to someone who harvested crops. The word \"crap\" ultimately comes from Medieval Latin crappa, meaning \"chaff\".","The expression \"rule of thumb\" did not originate from a law allowing a man to beat his wife with a stick no thicker than his thumb, and there is no evidence that such a law ever existed. The true origin of this phrase remains uncertain, but the false etymology has been broadly reported in media including The Washington Post (1989), CNN (1993), and Time magazine (1983).","\"Golf\" did not originate as an acronym of \"Gentlemen Only, Ladies Forbidden\". The word's true origin is unknown, but it existed in the Middle Scots period.","The word \"gringo\" did not originate during the Mexican-American War (1846–48), the Venezuelan War of Independence (1811–23), the Mexican Revolution (1910–20), or in the American Old West (c. 1865–99) as a corruption of the lyrics \"green grow\" in either \"Green Grow the Lilacs\" or \"Green Grow the Rushes, O\" sung by US-American soldiers or cowboys; nor did it originate during any of these times as a corruption of \"Green go home!\", falsely said to have been shouted at green-clad American troops. The word originally simply meant \"foreigner\", and is probably a corruption of Spanish griego, \"Greek\".","\"420\" did not originate as the Los Angeles police or penal code for marijuana use. Police Code 420 means \"juvenile disturbance\", and California Penal Code section 420 prohibits the obstruction of access to public land. The use of \"420\" started in 1971 at San Rafael High School, where it indicated the time, 4:20 pm, when a group of students would go to smoke under the statue of Louis Pasteur.","The word \"the\" was never pronounced or spelled \"ye\" in Old or Middle English. The confusion derives from the use of the character thorn (þ) in abbreviations of the word \"the\", which in Middle English text (Middle English the.svg) looked similar to a y with a superscript e.","\"Xmas\" did not originate as a secular plan to \"take the Christ out of Christmas\". X stands for the Greek letter Chi, the starting letter of Χριστός, or \"Christ\" in Greek. The use of the word \"Xmas\" in English can be traced to the year 1021 when \"monks in Great Britain...used the X while transcribing classical manuscripts into Old English\" in place of \"Christ\". The Oxford English Dictionary's \"first recorded use of 'Xmas' for 'Christmas' dates back to 1551.\"","Although the expression \"the enemy of my enemy is my friend\" is often described as an Arabic proverb, there is no evidence of such an origin. Its exact origin is unknown. The Latin saying amicus meus, inimicus inimici mei (\"my friend, the enemy of my enemy\") was widely used in 18th century Europe.","The Chevrolet Nova sold very well in Latin American markets; General Motors did not need to rename the car. While \"no va\" does mean \"it doesn't go\" in Spanish, \"nova\" is understood as \"new\" and drivers in Mexico and Venezuela where it was first sold bought it eagerly. There was no need to change the model name, as is still claimed there was.","Vomiting was not a regular part of Roman dining customs. In ancient Rome, the architectural feature called a vomitorium was the entranceway through which crowds entered and exited a stadium, not a special room used for purging food during meals.","Roman gladiators did not ritually say \"Hail Emperor, we who are about to die salute you\" before combat. Two ancient Roman historians recount that in the year 52 AD, a large group of criminals condemned to fight each other to the death in a large staged naval battle on an artificial lake greeted Emperor Claudius that way; he may possibly have pardoned them as a result. That is the only recorded use of the phrase in ancient Rome.","The Library of Alexandria was not destroyed by the Muslim Army during the capture of the city in 641. A common misconception alleged that Caliph Umar ordered the destruction based on the reasoning \"If those books are in agreement with the Quran, we have no need of them; and if these are opposed to the Quran, destroy them\" (or its variation). This story did not appear in writing until hundreds of years after the alleged incident (most famously in the work of Bar Hebraeus in the 13th century) and contemporary accounts of the Arab invasion do not include any account of the library's destruction. Modern consensus suggests the library had likely already been destroyed centuries before this incident. (It is instead believed that the Library of Caesarea, a key repository of Christian literature, was the library destroyed near this time.)","It is true that life expectancy in the Middle Ages and earlier was low; however, one should not infer that people usually died around the age of 30. In fact, earlier low life expectancies were very strongly influenced by high infant mortality, and the life expectancy of people who lived to adulthood was much higher. A 21-year-old man in medieval England, for example, could by one estimate expect to live to the age of 64.","There is no evidence that Vikings wore horns on their helmets. In fact, the image of Vikings wearing horned helmets stems from the scenography of an 1876 production of the Der Ring des Nibelungen opera cycle by Richard Wagner.","King Canute did not command the tide to reverse in a fit of delusional arrogance. His intent that day, if the incident even happened, was most likely to prove a point to members of his privy council that no man is all-powerful, and we all must bend to forces beyond our control, such as the tides.","There is no evidence that iron maidens were invented in the Middle Ages or even used for torture. Instead they were pieced together in the 18th century from several artifacts found in museums in order to create spectacular objects intended for (commercial) exhibition.","The plate armor of European soldiers did not stop soldiers from moving around or necessitate a crane to get them into a saddle. They would as a matter of course fight on foot and could mount and dismount without help. In fact, soldiers equipped with plate armor were more mobile than those with mail armor (chain armor), as mail was heavier and required stiff padding beneath due to its pliable nature. It is true that armor used in tournaments in the late Middle Ages was significantly heavier than that used in warfare, which may have contributed to this misconception.","Modern historians dispute the popular misconception that the chastity belt, a device designed to prevent women from having sexual intercourse, was invented in medieval times. Most existing chastity belts are now thought to be deliberate fakes or anti-masturbatory devices from the 19th and early 20th centuries. The latter were made due to the widespread belief that masturbation could lead to insanity, and were mostly bought by parents for their teenage children.","Medieval Europeans did not believe Earth was flat; in fact, from the time of the ancient Greek philosophers Plato and Aristotle, belief in a spherical Earth remained almost universal among European intellectuals. As a result, Christopher Columbus's efforts to obtain support for his voyages were hampered not by belief in a flat Earth but by valid worries that the East Indies were farther than he realized. If the Americas had not existed, he would surely have run out of supplies before reaching Asia.","Columbus never reached any land that now forms part of the mainland United States of America; most of the landings Columbus made on his four voyages, including the initial October 12, 1492 landing (the anniversary of which forms the basis of Columbus Day), were on Caribbean islands which today are independent countries. Columbus was also not the first European to visit the Americas: at least one explorer, Leif Ericson, preceded him by reaching what is believed to be the island now known as Newfoundland, part of modern Canada, though he never made it to the mainland.","There is a legend that Marco Polo imported pasta from China which originated with the Macaroni Journal, published by an association of food industries with the goal of promoting the use of pasta in the United States. Marco Polo describes a food similar to \"lagana\" in his Travels, but he uses a term with which he was already familiar. Durum wheat, and thus pasta as it is known today, was introduced by Arabs from Libya, during their conquest of Sicily in the late 7th century, according to the newsletter of the National Macaroni Manufacturers Association, thus predating Marco Polo's travels to China by about six centuries.","Contrary to the popular image of the Pilgrim Fathers, the early settlers of the Plymouth Colony did not wear all black, and their capotains (hats) were shorter and rounder than the widely depicted tall hat with a buckle on it. Instead, their fashion was based on that of the late Elizabethan era: doublets, jerkins and ruffs. Both men and women wore the same style of shoes, stockings, capes, coats and hats in a range of colors including reds, yellows, purples, and greens. According to Plimoth Plantation historian James W. Baker, the traditional image was formed in the 19th century when buckles were a kind of emblem of quaintness.","The accused at the Salem witch trials were not burned at the stake; about 15 died in prison, 19 were hanged and one was pressed to death.","Marie Antoinette did not say \"let them eat cake\" when she heard that the French peasantry were starving due to a shortage of bread. The phrase was first published in Rousseau's Confessions when Marie was only nine years old and most scholars believe that Rousseau coined it himself, or that it was said by Maria-Theresa, the wife of Louis XIV. Even Rousseau (or Maria-Theresa) did not use the exact words but actually Qu'ils mangent de la brioche, \"Let them eat brioche\" (a rich type of bread). Marie Antoinette was an unpopular ruler; therefore, people attribute the phrase \"let them eat cake\" to her, in keeping with her reputation as being hard-hearted and disconnected from her subjects.","George Washington did not have wooden teeth. His dentures were made of gold, hippopotamus ivory, lead, animal teeth (including horse and donkey teeth), and probably human teeth from slaves.","The signing of the United States Declaration of Independence did not occur on July 4, 1776. The final language of the document was approved by the Second Continental Congress on that date and it was printed and distributed on July 4 and 5, but the actual signing occurred on August 2, 1776.","Benjamin Franklin did not propose that the wild turkey be used as the symbol for the United States instead of the bald eagle. While he did serve on a commission that tried to design a seal after the Declaration of Independence, his proposal was an image of Moses. His objections to the eagle as a national symbol and preference for the turkey were stated in a 1784 letter to his daughter in response to the Society of the Cincinnati's use of the former; he never expressed that sentiment publicly.","There was never a bill to make German the official language of the United States that was defeated by one vote in the House of Representatives, nor has one been proposed at the state level. In 1794, a petition from a group of German immigrants was put aside on a procedural vote of 42 to 41, that would have had the government publish some laws in German. This was the basis of the Muhlenberg legend, named after the Speaker of the House at the time, Frederick Muhlenberg, a speaker of German descent who abstained from this vote.","Napoleon Bonaparte was not short. He was actually slightly taller than the average Frenchman of his time. After his death in 1821, the French emperor's height was recorded as 5 feet 2 inches in French feet, which is 5 feet 7 inches (1.69 m). Some believe that he was nicknamed le Petit Caporal (The Little Corporal) as a term of affection. Napoléon was often accompanied by his imperial guard, who were selected for their height - some suggest that this could have contributed to a perception that he was relatively short.","Cinco de Mayo is not Mexico's Independence Day, but the celebration of the Mexican Army's victory over the French in the Battle of Puebla on May 5, 1862. Mexico's Independence from Spain is celebrated on September 16.","The Great Chicago Fire of 1871 was not caused by Mrs. O'Leary's cow kicking over a lantern. A newspaper reporter invented the story to make colorful copy.","The claim that Frederick Remington, on assignment to Cuba, telegraphed William Randolph Hearst that \"...There will be no war. I wish to return\" and that Hearst responded, \"Please remain. You furnish the pictures, and I'll furnish the war\" is unsubstantiated. Although this claim is included in a book by James Creelman, there is no evidence that the telegraph exchange ever happened, and substantial evidence that it did not.","Immigrants' last names were not Americanized (voluntarily, mistakenly, or otherwise) at Ellis Island. Officials there kept no records other than checking ship manifests created at the point of origin, and there was simply no paperwork which would have created such an effect, let alone any law. At the time in New York, anyone could change the spelling of their name simply by using that new spelling. ","The popular image of Santa Claus was not created by The Coca-Cola Company as an advertising gimmick; by the time Coca-Cola began using Santa Claus's image in the 1930s, Santa Claus had already taken his modern form in popular culture, having already seen extensive use in other companies' advertisements and other mass media.","Italian dictator Benito Mussolini did not \"make the trains run on time\". Much of the repair work had been performed before Mussolini and the Fascists came to power in 1922. Accounts from the era also suggest that the Italian railways' legendary adherence to timetables was more propaganda than reality.","There was no widespread outbreak of panic across the United States in response to Orson Welles' 1938 radio adaptation of H.G. Wells' The War of the Worlds. Only a very small share of the radio audience was even listening to it, and isolated reports of scattered incidents and increased call volume to emergency services were played up the next day by newspapers, eager to discredit radio as a competitor for advertising. Both Welles and CBS, which had initially reacted apologetically, later came to realize that the myth benefited them and actively embraced it in their later years.","There is no evidence of Polish cavalry mounting a brave but futile charge against German tanks using lances and sabres during the German invasion of Poland in 1939. This story may have originated from German propaganda efforts following the charge at Krojanty, in which a Polish cavalry brigade surprised German infantry in the open, and successfully charged and dispersed them, until driven off by armoured cars. While Polish cavalry still carried the sabre for such opportunities, they were trained to fight as highly mobile, dismounted cavalry (dragoons) and issued with light anti-tank weapons.","During the occupation of Denmark by the Nazis during World War II, King Christian X of Denmark did not thwart Nazi attempts to identify Jews by wearing a yellow star himself. Jews in Denmark were never forced to wear the Star of David. The Danish resistance did help most Jews flee the country before the end of the war.","Albert Einstein did not fail mathematics in school. Upon seeing a column making this claim, Einstein said \"I never failed in mathematics... Before I was fifteen I had mastered differential and integral calculus.\" Einstein did however fail the entrance exam into the Swiss Federal Polytechnic School on his first attempt in 1895, although he was two years younger than his fellow students at the time and scored exceedingly well in the mathematics and science sections.","Actor Ronald Reagan was never seriously considered for the role of Rick Blaine in the 1942 film classic Casablanca, eventually played by Humphrey Bogart. This belief came from an early studio press release announcing the film's production that used his name to generate interest in the film. But by the time it had come out, Warner Bros. knew that Reagan was unavailable for any roles in the foreseeable future since he was no longer able to defer his entry into military service. Studio records show that producer Hal B. Wallis had always wanted Bogart for the part.","U.S. Senator George Smathers never gave a speech to a rural audience describing his opponent, Claude Pepper, as an \"extrovert\" whose sister was a \"thespian\", in the apparent hope they would confuse them with similar-sounding words like \"pervert\" and \"lesbian\". Time, which is sometimes cited as the source, described the story of the purported speech as a \"yarn\" at the time, and no Florida newspaper reported such a speech during the campaign. The leading reporter who covered Smathers said he always gave the same boilerplate speech. Smathers had offered US$10,000 to anyone who could prove he had made the speech; it was never claimed.","John F. Kennedy's words \"Ich bin ein Berliner\" are standard German for \"I am a Berliner.\" An urban legend has it that due to his use of the indefinite article ein, Berliner is translated as jelly doughnut, and that the population of Berlin was amused by the supposed mistake. The word Berliner is not commonly used in Berlin to refer to the Berliner Pfannkuchen; they are usually called ein Pfannkuchen.","African American intellectual and activist W.E.B. Du Bois did not renounce his U.S. citizenship while living in Ghana shortly before his death, as is often claimed. In early 1963, due to his membership in the Communist Party and support for the Soviet Union, the U.S. State Department did not renew his passport while he was already in Ghana overseeing the creation of the Encyclopedia Africana. After leaving the embassy, he stated his intention to renounce his citizenship in protest. But while he took Ghanaian citizenship, he never went through the process of renouncing his American citizenship, and may not even have intended to.","When bartender Kitty Genovese was murdered outside her Queens apartment in 1964, 37 neighbors did not stand idly by and watch, not calling the police until after she was dead, as The New York Times initially reported to widespread public outrage that persisted for years. Later reporting established that the police report the Times had initially relied on was inaccurate, that Genovese had been attacked twice in different locations, and while the many witnesses heard the attack they only heard brief portions and did not realize what was occurring, with only six or seven actually reporting seeing anything. Some called police; one who didn't said \"I didn't want to get involved\", an attitude which later came to be attributed to all the residents who saw or heard part of the attack.","The Rolling Stones were not performing \"Sympathy for the Devil\" at the 1969 Altamont Free Concert when Meredith Hunter was stabbed to death by a member of the local Hells Angels chapter that was serving as security. While the incident that culminated in Hunter's death began while the band was performing the song, prompting a brief interruption before the Stones finished it, it concluded several songs later as the band was performing \"Under My Thumb\". The misconception arose from mistaken reporting in Rolling Stone.","While it was praised by one architectural magazine prior to its construction as \"the best high apartment of the year\", the Pruitt–Igoe housing project in St. Louis, Missouri, considered to epitomize the failures of urban renewal in American cities after it was demolished in the early 1970s, never won any awards for its design. The architectural firm that designed the buildings did win an award for an earlier St. Louis project, which may have been confused with Pruitt–Igoe.","Although popularly known as the \"red telephone\", the Moscow–Washington hotline was never a telephone line, nor were red phones used. The first implementation of the hotline used teletype equipment, which was replaced by facsimile (fax) machines in 1988. Since 2008, the hotline has been a secure computer link over which the two countries exchange emails. Moreover, the hotline links the Kremlin to the Pentagon, not the White House.","It is commonly claimed that the Great Wall of China is the only human-made object visible from the Moon. This is false. None of the Apollo astronauts reported seeing any specific human-made object from the Moon, and even Earth-orbiting astronauts can barely see it. City lights, however, are easily visible on the night side of Earth from orbit. Shuttle astronaut Jay Apt has been quoted as saying that \"the Great Wall is almost invisible from only 180 miles (290 km) up.\" (See Man-made structures visible from space.) ISS commander Chris Hadfield attempted to find it from space, but said that it was \"hard as it's narrow and dun-colored.\"","Black holes, contrary to their common image, have the same gravitational effects as any other equal mass in their place. They will draw objects nearby towards them, just as any other planetary body does, except at very close distances. If, for example, the Sun were replaced by a black hole of equal mass, the orbits of the planets would be essentially unaffected. A black hole can act like a \"cosmic vacuum cleaner\" and pull a substantial inflow of matter, but only if the star it forms from is already having a similar effect on surrounding matter.","Seasons are not caused by the Earth being closer to the Sun in the summer than in the winter. In fact, the Earth is farthest from the Sun when it is summer in the Northern Hemisphere. Seasons are caused by Earth's 23.4-degree axial tilt. In July, the Northern Hemisphere is tilted towards the Sun resulting in longer days and more direct sunlight; in January, it is tilted away. The seasons are reversed in the Southern Hemisphere, which is tilted towards the Sun in January and away from the Sun in July.","Meteorites are not necessarily hot when they reach the Earth's surface. In fact, many meteorites are found with frost on them. As they enter the atmosphere, having been warmed only by the sun, meteors have a temperature below freezing. The intense heat produced during passage through the upper atmosphere at very high speed then melts a meteor's outside layer, but molten material is blown off and the interior does not have time to warm appreciably. Most meteorites fall through the relatively cool lower atmosphere for as long as several minutes at subsonic velocity before reaching the ground, giving plenty of time for their exterior to cool off again.","When a meteor or spacecraft enters the atmosphere, the heat of entry is not (primarily) caused by friction, but by adiabatic compression of air in front of the object.","Egg balancing is possible on every day of the year, not just the vernal equinox, and there is no relationship between astronomical phenomena and the ability to balance an egg. The tradition of balancing eggs on a particular date originates in China, when it was reported on by Life magazine in 1945. However, it was reported in 1987 that Frank Ghigo was able to balance some eggs on every day from February 27 to April 3, 1984. At the same time, he also found that \"...some eggs would simply never balance, on the equinox or otherwise.\"","The Sun's color is white, with a CIE color-space index near (0.3, 0.3), when viewed from space or when high in the sky; when low in the sky, atmospheric scattering renders the Sun yellow, red, orange, or magenta. Despite its typical whiteness, most people mentally picture the Sun as yellow; the reasons for this are the subject of debate.","Older elephants that are near death do not leave their herd and instinctively direct themselves toward a specific location known as an elephants' graveyard to die.","Bulls are not enraged by the color red, used in capes by professional matadors. Cattle are dichromats, so red does not stand out as a bright color. It is not the color of the cape, but the perceived threat by the matador that incites it to charge.","Contrary to popular belief, dogs do not sweat by salivating. Dogs actually do have sweat glands and not only on their tongues. They sweat, mainly through the footpads. However, dogs do primarily regulate their body temperature through panting. See also Dog anatomy.","Lemmings do not engage in mass suicidal dives off cliffs when migrating. This misconception was popularized by the Disney film White Wilderness, which shot many of the migration scenes (also staged by using multiple shots of different groups of lemmings) on a large, snow-covered turntable in a studio. Photographers later pushed the lemmings off a cliff. The misconception itself is much older, dating back to at least the late 19th century.","Bats are not blind. While about 70 percent of bat species, mainly in the microbat family, use echolocation to navigate, all bat species have eyes and are capable of sight. In addition, almost all bats in the megabat or fruit bat family cannot echolocate and have excellent night vision.","Ostriches do not stick their heads in the sand to hide from enemies. This misconception was probably promulgated by Pliny the Elder (AD 23–79), who wrote that ostriches \"imagine, when they have thrust their head and neck into a bush, that the whole of their body is concealed.\"","A duck's quack actually does echo, although the echo may be difficult to hear for humans under some circumstances.","The notion that goldfish have a memory span of just a few seconds is false. It is much longer, counted in months.","Sharks can actually suffer from cancer. The misconception that sharks do not get cancer was spread by the 1992 Avery Publishing book Sharks Don't Get Cancer by I. William Lane and used to sell extracts of shark cartilage as cancer prevention treatments. Reports of carcinomas in sharks exist, and current data do not allow any speculation about the incidence of tumors in sharks.","Great white sharks do not mistake human divers for pinnipeds, their attack behaviors on humans and pinnipeds are very different: when attacking seals, great white sharks will surface quickly and violently attack it, on the contrary, attacks on humans are more relaxed and slow, with the shark charging at normal pace, bites, and swims off, the reason for this is great white sharks have efficient eyesight and color vision, the bite is simply for identification of an unfamiliar object, not predatory.","It is a common misconception that an earthworm becomes two worms when cut in half. However, only a limited number of earthworm species are capable of anterior regeneration. When such earthworms are bisected, only the front half of the worm (where the mouth is located) can feed and survive, while the other half dies. Species of the planarian flatworms actually do become two new planarians when bisected or split down the middle.","Houseflies do not have an average lifespan of 24 hours (though the adults of some species of mayflies do). The average lifespan of a housefly is 20 to 30 days. However, a housefly maggot will hatch within 24 hours of being laid.","According to urban legend, the daddy longlegs spider (Pholcidae) is the most venomous spider in the world, but the shape of their mandibles leaves them unable to bite humans, rendering them harmless to our species. In reality, they can indeed pierce human skin, though the tiny amount of venom they carry causes only a mild burning sensation for a few seconds. In addition, there is also confusion regarding the use of the name daddy longlegs, because harvestmen (order Opiliones, which are arachnids, but not spiders) and crane flies (which are insects) are also known as daddy longlegs, and share the misconception of being venomous.","The flight mechanism and aerodynamics of the bumblebee (as well as other insects) are actually quite well understood, despite the urban legend that calculations show that they should not be able to fly. In the 1930s, the French entomologist Antoine Magnan indeed postulated that bumblebees theoretically should not be able to fly in his book Le Vol des Insectes (The Flight of Insects). Magnan later realized his error and retracted the suggestion. However, the hypothesis became generalized to the false notion that \"scientists think that bumblebees should not be able to fly\".","Poinsettias are not highly toxic to humans or cats. While it is true that they are mildly irritating to the skin or stomach, and may sometimes cause diarrhea and vomiting if eaten, an American Journal of Emergency Medicine study of 22,793 cases reported to the American Association of Poison Control Centers showed no fatalities and few cases requiring medical treatment. According to the ASPCA, poinsettias may cause light to mid-range gastrointestinal discomfort in felines, with diarrhea and vomiting as the most severe consequences of ingestion.","Flowering sunflowers do not track the Sun across the sky. The heads point in a fixed direction (East) all day long. However, in an earlier development stage, before the appearance of flower heads, the buds do track the sun and the fixed alignment of the mature flowers is a result of this heliotropism.","The word theory in the theory of evolution does not imply mainstream scientific doubt regarding its validity; the concepts of theory and hypothesis have specific meanings in a scientific context. While theory in colloquial usage may denote a hunch or conjecture, a scientific theory is a set of principles that explains observable phenomena in natural terms. \"Scientific fact and theory are not categorically separable\", and evolution is a theory in the same sense as germ theory or the theory of gravitation.","Evolution does not attempt to explain the origin of life or the origin and development of the universe. While biological evolution describes the process by which species and other levels of biological organization originate, and ultimately leads all life forms back to a universal common ancestor, it is not primarily concerned with the origin of life itself, and does not pertain at all to the origin and evolution of the universe and its components. The theory of evolution deals primarily with changes in successive generations over time after life has already originated. The scientific model concerned with the origin of the first organisms from organic or inorganic molecules is known as abiogenesis, and the prevailing theory for explaining the early development of our universe is the Big Bang model. ","Humans did not evolve from either of the living species of chimpanzees. Humans and chimpanzees did however evolve from a common ancestor. The two modern species (common chimpanzees and bonobos) are humans' closest living relatives and some anthropologists and primatologists accept that humans are not only descended from a common ancestor, but are themselves a species of living chimpanzee. The most recent common ancestor of humans and the other living chimpanzees lived between 5 and 8 million years ago. Finds of the 4.4 million year old Ardipithecus indicate the ancestor was a moderately competent bipedal walker rather than a knucklewalker, and was small and rather more long limbed than a chimpanzee and with a shorter snout. Contrary to the idea of chimpanzees as \"primitive\", they too have evolved since the split, becoming larger, more aggressive and more capable climbers. Together with the other apes, humans and chimpanzees constitute the family Hominidae. This group evolved from a common ancestor with the Old World monkeys some 40 million years ago.","Evolution is not a progression from inferior to superior organisms, and it also does not necessarily result in an increase in complexity. A population can evolve to become simpler, having a smaller genome, but biological devolution is a misnomer.","Evolution does not \"plan\" to improve an organism's fitness to survive. For example, an incorrect way to describe giraffe evolution is to say that giraffe necks grew longer over time because they needed to reach tall trees. Evolution does not see a need and respond; it is instead a goalless process. A mutation resulting in longer necks would be more likely to benefit an animal in an area with tall trees than an area with short trees, and thus enhance the chance of the animal surviving to pass on its longer-necked genes. Tall trees could not cause the mutation nor would they cause a higher percentage of animals to be born with longer necks. In the giraffe example, the evolution of a long neck may equally well have been driven by sexual selection, proposing that the long necks evolved as a secondary sexual characteristic, giving males an advantage in \"necking\" contests over females. The misconception is encouraged as it is common shorthand for people who understand how evolution works to speak of a purpose as a concise form of expression (sometimes called the \"metaphor of purpose\"); it is less cumbersome to say \"Dinosaurs may have evolved feathers for courtship\" than \"Feathers may have been selected for when they arose as they gave dinosaurs a selective advantage over their non-feathered peers\".","Humans and dinosaurs (other than birds) did not coexist. The last of the non-avian dinosaurs died 66 million years ago in the course of the Cretaceous–Paleogene extinction event, whereas the earliest Homo genus (humans) evolved between 2.3 and 2.4 million years ago. This places a 63 million year expanse of time between the last non-bird dinosaurs and the earliest humans. Humans did coexist with wooly mammoths and saber-toothed cats—mammals which are often depicted with humans and dinosaurs.","Dinosaurs did not become extinct due to being generally maladapted or unable to cope with normal climatic change, a view found in many older textbooks. In fact, dinosaurs comprised an extremely adaptive and successful group, whose demise was brought about by an extraordinary event that also extinguished many groups of plants, mammals and marine life. The most commonly cited cause is that of an asteroid impact on the Yucatán Peninsula, triggering the Cretaceous–Paleogene extinction event. Also, not all dinosaurs went extinct. Birds evolved from small feathered theropods in the Jurassic, and while most dinosaur lineages were cut short at the end of the Cretaceous, some birds survived. Consequently, dinosaur descendants are part of the modern fauna.","Mammals did not evolve from any modern group of reptiles. Soon after the first reptiles appeared, they split into two branches, the sauropsids and the synapsids. The line leading to mammals (the synapsids) diverged from the line leading to modern reptilian lines (the sauropsids) about 320 million years ago, in the mid Carboniferous period. Only later (in the late Carboniferous or early Permian) did the modern reptilian groups (lepidosaurs, turtles and crocodiles) diverge. The mammals themselves, being the only survivors of the synapsid line, are the \"cousins\" rather than \"siblings\" of modern reptiles."]